Функция ГлавныйРесторан() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Рестораны.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Рестораны КАК Рестораны
		|ГДЕ
		|   НЕ Рестораны.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();        
	
	Ресторан = Справочники.Рестораны.ПустаяСсылка();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий(); 
		Ресторан = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Ресторан;
	
КонецФункции