#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
		
		 // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды    
		
	Если Объект.Проведен Тогда          
		Элементы.ТипЗаявки.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ТипЗаявки = ПредопределенноеЗначение("Перечисление.ТипыЗаявок.Инцидент") Тогда
		Элементы.Актив.Видимость = Истина;
		Элементы.ПричинаОбращения.Видимость = Истина;
		Элементы.Комментарий.Видимость = Истина; 
	    Элементы.ФормаОформитьИнцидент.Видимость = Истина;
	ИначеЕсли Объект.ТипЗаявки = ПредопределенноеЗначение("Перечисление.ТипыЗаявок.Услуга") Тогда  
		Элементы.ПредоставлениеУслуг.Видимость = Истина;
		Элементы.Длительность.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;    
		Элементы.ФормаПредоставлениеУслуг.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры                    


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

&НаКлиенте
Процедура ОформитьИнцидент(Команда)
	// Флаг, указывающий на то, был ли документ записан
	ДокументЗаписан = Ложь;	

	// Проверяем, пустая ли ссылка на объект (документ)
	Если Объект.Ссылка.Пустая() Тогда
		// Если ссылка пустая, создаем новый документ в режиме проведения
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);   
	Иначе 
		// Если ссылка не пустая, документ уже существует, устанавливаем флаг в истину
		ДокументЗаписан = Истина;
	КонецЕсли;
	
	// Если документ успешно записан
	Если ДокументЗаписан Тогда
		// Подготавливаем параметры для открытия формы
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		// Открываем форму плана производства с блокировкой окна владельца
		ОткрытьФорму("Документ.Инцидент.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

&НаКлиенте                                 
Процедура ТипЗаявкиПриИзменении(Элемент)   

	Если Объект.ТипЗаявки = ПредопределенноеЗначение("Перечисление.ТипыЗаявок.Инцидент") Тогда    
		
		Объект.ПредоставлениеУслуг.Очистить();
		Объект.Длительность = Неопределено;
		Объект.ДатаОкончания = Неопределено;
		Элементы.ПредоставлениеУслуг.Видимость = Ложь;
		Элементы.Длительность.Видимость = Ложь;
		Элементы.ДатаОкончания.Видимость = Ложь;  
		Элементы.ФормаПредоставлениеУслуг.Видимость = Ложь;
		Элементы.Актив.Видимость = Истина;
		Элементы.ПричинаОбращения.Видимость = Истина;
		Элементы.Комментарий.Видимость = Истина;     
		Элементы.ФормаОформитьИнцидент.Видимость = Истина;            
            		
	ИначеЕсли Объект.ТипЗаявки = ПредопределенноеЗначение("Перечисление.ТипыЗаявок.Услуга") Тогда  
		
		Объект.Актив = Неопределено;
		Объект.ПричинаОбращения = Неопределено;
		Объект.Комментарий= Неопределено;
		Элементы.Актив.Видимость = Ложь;
		Элементы.ПричинаОбращения.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Ложь;   
		Элементы.ФормаОформитьИнцидент.Видимость = Ложь;
		Элементы.ПредоставлениеУслуг.Видимость = Истина;
		Элементы.ФормаПредоставлениеУслуг.Видимость = Истина;        
		
	КонецЕсли;
	
КонецПроцедуры  

#Область СлужебныеПроцедурыИФункции

 &НаСервереБезКонтекста
Функция ПолучитьИнформациюОбУслуге(Услуга, Дата)
	
	Результат = Новый Структура("Длительность, Цена", 0, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныУслугСрезПоследних.Цена, 0) КАК Цена,
		|	Услуги.SLA КАК Длительность
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныУслуг.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныУслугСрезПоследних
		|		ПО Услуги.Ссылка = ЦеныУслугСрезПоследних.Услуга
		|ГДЕ
		|	Услуги.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();	                      
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка); 
	КонецЕсли;
	
    Возврат Результат;  
	Сообщить("Услуга: " + Услуга);
	Сообщить("Дата: " + Дата);	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПредоставлениеУслуг(Команда)  
	// Флаг, указывающий на то, был ли документ записан
	ДокументЗаписан = Ложь;	

	// Проверяем, пустая ли ссылка на объект (документ)
	Если Объект.Ссылка.Пустая() Тогда
		// Если ссылка пустая, создаем новый документ в режиме проведения
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);   
	Иначе 
		// Если ссылка не пустая, документ уже существует, устанавливаем флаг в истину
		ДокументЗаписан = Истина;
	КонецЕсли;
	
	// Если документ успешно записан
	Если ДокументЗаписан Тогда
		// Подготавливаем параметры для открытия формы
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		// Открываем форму плана производства с блокировкой окна владельца
		ОткрытьФорму("Документ.ОказаниеУслуги.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры   


&НаКлиенте
Процедура ПредоставлениеУслугУслугаПриИзменении(Элемент) 
	
	// Получить текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.ПредоставлениеУслуг.ТекущиеДанные;  
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		СтрокаТабличнойЧасти.ВремяРаботы = 0;
		СтрокаТабличнойЧасти.Цена = 0;
	Иначе
	ИнформацияОбУслуге = ПолучитьИнформациюОбУслуге(СтрокаТабличнойЧасти.Услуга, Объект.Дата);
	СтрокаТабличнойЧасти.ВремяРаботы = ИнформацияОбУслуге.Длительность;
    СтрокаТабличнойЧасти.Цена = ИнформацияОбУслуге.Цена;
    КонецЕсли;
	// Устанавливаем цену для текущей строки табличной части
	//СтрокаТабличнойЧасти.Цена = АвтоЦена.АктуальнаяЦенаУслуг( 
	//	Объект.Дата, СтрокаТабличнойЧасти.Услуга);    
	// Устанавливаем количество товара равным 1
	СтрокаТабличнойЧасти.Количество = 1;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти); 
	РасчетДлительности.РассчитатьДлительность(СтрокаТабличнойЧасти);
	Объект.Длительность = Объект.ПредоставлениеУслуг.Итог("ИтоговаяДлительность");     
    Элементы.Длительность.Видимость = Истина;   
    Элементы.ДатаОкончания.Видимость = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставлениеУслугЦенаПриИзменении(Элемент)
	
	// Получаем текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.ПредоставлениеУслуг.ТекущиеДанные;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);   
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставлениеУслугКоличествоПриИзменении(Элемент)  
	
	// Получаем текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.ПредоставлениеУслуг.ТекущиеДанные;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
	РасчетДлительности.РассчитатьДлительность(СтрокаТабличнойЧасти);
	Объект.Длительность = Объект.ПредоставлениеУслуг.Итог("ИтоговаяДлительность");
КонецПроцедуры


&НаКлиенте
Процедура ПредоставлениеУслугВремяРаботыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПредоставлениеУслуг.ТекущиеДанные;
	РасчетДлительности.РассчитатьДлительность(СтрокаТабличнойЧасти);
	Объект.Длительность = Объект.ПредоставлениеУслуг.Итог("ИтоговаяДлительность");
КонецПроцедуры


&НаКлиенте
Процедура ПредоставлениеУслугИтоговаяДлительностьПриИзменении(Элемент) 
	
	Объект.Длительность = Объект.ПредоставлениеУслуг.Итог("ИтоговаяДлительность"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставлениеУслугПослеУдаления(Элемент)                  
	
	Объект.Длительность = Объект.ПредоставлениеУслуг.Итог("ИтоговаяДлительность");  
	
КонецПроцедуры
