&НаСервере
Процедура ЗаполнитьНаСервере()  
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос; // Создание нового объекта запроса
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Адрес КАК Адрес,
		|	Клиенты.Телефон КАК Телефон
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК Клиенты
		|		ПО Реализация.Заказ.Заказчик = Клиенты.Ссылка"; // Формирование SQL-запроса

	РезультатЗапроса = Запрос.Выполнить(); // Выполнение запроса и получение результата
	
	Выборка = РезультатЗапроса.Выбрать(); // Создание выборки из результата запроса
	
	Пока Выборка.Следующий() Цикл // Цикл по всем записям выборки
		Объект.АдресНазначения = Выборка.Адрес; // Заполнение поля "АдресНазначения" объекта
		Объект.Телефон = Выборка.Телефон; // Заполнение поля "Телефон" объекта
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)  
	
	// Проверяем, что документ имеет ссылку (т.е. он записан)
	Если Объект.Ссылка = Неопределено Тогда
		Сообщить("Документ не записан. Пожалуйста, сохраните документ перед заполнением."); 
		Возврат; // Прерываем выполнение процедуры
	КонецЕсли;
	
	ЗаполнитьНаСервере(); // Вызов процедуры заполнения данных на сервере
	
КонецПроцедуры

	 

