
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Зарплата.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Зарплата.Дата КАК Дата,
	|	Зарплата.Месяц КАК Месяц,
	|	Зарплата.Ресторан КАК Ресторан,
	|	Зарплата.Сотрудники.(
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник,
	|		Сумма КАК Сумма,
	|		Оклад КАК Оклад,
	|		ЗаработнаяПлата КАК ЗаработнаяПлата
	|	) КАК Сотрудники,
	|	Рестораны.Логотип КАК Логотип,
	|	Зарплата.Номер КАК Номер
	|ИЗ
	|	Документ.Зарплата КАК Зарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Рестораны КАК Рестораны
	|		ПО Зарплата.Ресторан = Рестораны.Ссылка
	|ГДЕ
	|	Зарплата.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	Подвал = Макет.ПолучитьОбласть("Подвал");   
	Разделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		// Вывод логотипа
		Если НЕ Выборка.Логотип.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Логотип);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаЛоготип = Новый Картинка(ДвоичныеДанные);
				ОбластьЗаголовок.Рисунки.Логотип.Картинка = КартинкаЛоготип;
			КонецЕсли;
		КонецЕсли; 
		Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.Дата = Дата;
		Шапка.Параметры.Заполнить(Выборка);
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл     
			ТабДок.Вывести(ОбластьЗаголовок);    
			ТабДок.Вывести(Шапка, Выборка.Уровень());  
			ТабДок.Вывести(ОбластьСотрудникиШапка);
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());   
			СуммаИтог = 0;
			СуммаИтог = СуммаИтог + ВыборкаСотрудники.Сумма;      
			ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Подвал.Параметры.Ответственный = ТекПользователь; 
		Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);   
		ТабДок.Вывести(Подвал);          
		ТабДок.Вывести(Разделитель);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
		ТабДок.Вывести(Разделитель);
	КонецЦикла; 
КонецЦикла;
КонецПроцедуры
