
Процедура ОбработкаПроведения(Отказ, РежимПроведения)     
	
	НаборЗаписей = РегистрыСведений.ВремяИзготовленияПродукции.СоздатьНаборЗаписей();   
	НаборЗаписей.Отбор.Продукция.Установить(Продукт);
	НаборЗаписей.Отбор.Цех.Установить(Цех);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		// Если записей нет, добавляем новую запись
		Запись = НаборЗаписей.Добавить();        
		Запись.Продукция = Продукт;
		Запись.Цех = Цех;
		Запись.Время = ВремяИзготовления;  
	КонецЕсли;
	НаборЗаписей.Записать();   
	
КонецПроцедуры
