

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Накладная.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ    
	|   Накладная.ITСервис КАК ITСервис,
	|	Накладная.ВидНакладной КАК ВидНакладной,
	|	Накладная.Дата КАК Дата,
	|	Накладная.Контрагент КАК Контрагент,
	|	Накладная.Номер КАК Номер,
	|	Накладная.СпособОплаты КАК Оплата,
	|	Накладная.АдресНазначения КАК Адрес,     
	|	Накладная.Телефон КАК Телефон,
	|	Накладная.Склад КАК Склад,
	|	Накладная.Сведения.(
	|		НомерСтроки КАК НомерСтроки,
	|		Название КАК Название,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Сведения,
	|	Контрагенты.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	Контрагенты.Логотип КАК Логотип,
	|	Контрагенты.ОтветственноеЛицо.Подпись КАК Подпись
	|ИЗ
	|	Документ.Накладная КАК Накладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО Накладная.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	Накладная.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСведенияШапка = Макет.ПолучитьОбласть("СведенияШапка");
	ОбластьСведения = Макет.ПолучитьОбласть("Сведения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;   
		
		// Вывод логотипа
		Если НЕ Выборка.Логотип.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Логотип);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаЛоготип = Новый Картинка(ДвоичныеДанные);
				ОбластьЗаголовок.Рисунки.Логотип.Картинка = КартинкаЛоготип;
			КонецЕсли;
		КонецЕсли;    
		Если НЕ Выборка.Подпись.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Подпись);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаПодпись = Новый Картинка(ДвоичныеДанные);
				Подвал.Рисунки.Подпись.Картинка = КартинкаПодпись;
			КонецЕсли;
		КонецЕсли;

		
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер; 
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ТабДок.Вывести(ОбластьЗаголовок);
        ТекПользователь = Выборка.ОтветственноеЛицо;
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
        СуммаИтог = 0;
		ТабДок.Вывести(ОбластьСведенияШапка);
		ВыборкаСведения = Выборка.Сведения.Выбрать();
		Пока ВыборкаСведения.Следующий() Цикл
			ОбластьСведения.Параметры.Заполнить(ВыборкаСведения);
			ТабДок.Вывести(ОбластьСведения, ВыборкаСведения.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаСведения.Сумма;
		КонецЦикла;
  		Подвал.Параметры.Ответственный = ТекПользователь;
		Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
