
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		ITСервис = ДанныеЗаполнения.ITСервис;
		Контрагент = ДанныеЗаполнения.Контрагент;
		АдресНазначения = ДанныеЗаполнения.Контрагент.КонтактнаяИнформация;
		Телефон = ДанныеЗаполнения.Контрагент.ОтветственноеЛицо.Телефон;
		СпособОплаты = ДанныеЗаполнения.СпособОплаты;
		Заказ = ДанныеЗаполнения.Ссылка;
		ВидНакладной = Перечисления.ВидыНакладной.Расходная;
		Для Каждого ТекСтрокаСоставЗаказа Из ДанныеЗаполнения.СоставЗаказа Цикл
			НоваяСтрока = Сведения.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСоставЗаказа.Количество;
			НоваяСтрока.Название = ТекСтрокаСоставЗаказа.Название;
			НоваяСтрока.Сумма = ТекСтрокаСоставЗаказа.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСоставЗаказа.Цена;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		ITСервис = ДанныеЗаполнения.ITСервис;
		Телефон = ДанныеЗаполнения.ITСервис.Телефон;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Склад = ДанныеЗаполнения.Склад;
		АдресНазначения = ДанныеЗаполнения.Склад.Адрес;
		Сумма = ДанныеЗаполнения.СоставЗаказа.Итог("Сумма");
		СпособОплаты = ДанныеЗаполнения.СпособОплаты;
		Заказ = ДанныеЗаполнения.Ссылка;
		ВидНакладной = Перечисления.ВидыНакладной.Приходная;
		Для Каждого ТекСтрокаСоставЗаказа Из ДанныеЗаполнения.СоставЗаказа Цикл
			НоваяСтрока = Сведения.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСоставЗаказа.Количество;
			НоваяСтрока.Название = ТекСтрокаСоставЗаказа.Название;
			НоваяСтрока.Сумма = ТекСтрокаСоставЗаказа.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСоставЗаказа.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, Режим)     
	
	Если ВидНакладной = Перечисления.ВидыНакладной.Расходная Тогда  	
		
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		Движения.Записать();   
		
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;   
		ЭлементБлокировки.ИсточникДанных = Сведения;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Название");
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладнаяСведения.Название КАК Номенклатура,
		|	НакладнаяСведения.Количество КАК Количество
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	Документ.Накладная.Сведения КАК НакладнаяСведения
		|ГДЕ
		|	НакладнаяСведения.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧТовары.Номенклатура КАК Номенклатура,
		|	втТЧТовары.Номенклатура.Представление КАК НоменклатураПредставление,
		|	втТЧТовары.Количество КАК Количество,
		|	ОстаткиНоменклатурыОстатки.ITСервис КАК ITСервис,
		|	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СебестоимостьОстаток, 0) КАК СебестоимостьОстаток,
		|	ВЫБОР
		|		КОГДА ОстаткиНоменклатурыОстатки.Склад = &Склад
		|			ТОГДА -1
		|		ИНАЧЕ ЕСТЬNULL(ПриоритетыСкладовСрезПоследних.Приоритет, 100)
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	втТЧТовары КАК втТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							втТЧТовары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							втТЧТовары КАК втТЧТовары)
		|					И ITСервис = &ITСервис
		|					И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПриоритетыСкладов.СрезПоследних(&МоментВремени, ) КАК ПриоритетыСкладовСрезПоследних
		|			ПО ОстаткиНоменклатурыОстатки.ITСервис = ПриоритетыСкладовСрезПоследних.Склад.ITСервис
		|				И ОстаткиНоменклатурыОстатки.Склад = ПриоритетыСкладовСрезПоследних.Склад
		|		ПО втТЧТовары.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());  
		Запрос.УстановитьПараметр("ITСервис", ITСервис);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Недостаточно товара %1 в количестве %2",
				ВыборкаНоменклатура.НоменклатураПредставление,
				ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			КоличествоСписать = ВыборкаНоменклатура.Количество;
			
			ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() И КоличествоСписать > 0 Цикл                        
				
				Количество = Мин(КоличествоСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
				
				Если Количество  = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
					Себестоимость = ВыборкаДетальныеЗаписи.СебестоимостьОстаток;
				Иначе
					Себестоимость = Количество / ВыборкаДетальныеЗаписи.КоличествоОстаток * ВыборкаДетальныеЗаписи.СебестоимостьОстаток;
				КонецЕсли;
				
				Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
				Движение.Период = Дата;
				Движение.Количество = Количество;
				Движение.Себестоимость = Себестоимость;
				
				КоличествоСписать = КоличествоСписать - Количество;  
			КонецЦикла;                                              
		КонецЦикла;
		
		// регистр Заказы 
		Движения.Заказы.Записывать = Истина;
		Для Каждого ТекСтрокаСведения Из Сведения Цикл
			Движение = Движения.Заказы.Добавить();
			Движение.Период = Дата;
			Движение.ITСервис = ITСервис;
			Движение.Номенклатура = ТекСтрокаСведения.Название;
			Движение.Клиент = Контрагент;
			Движение.Цена = ТекСтрокаСведения.Цена;
			Движение.Количество = ТекСтрокаСведения.Количество;
			Движение.Сумма = ТекСтрокаСведения.Сумма;
		КонецЦикла;
		// Перебираем все документы "ЗаказКлиента"
		ЗаказыКлиентов = Документы.ЗаказКлиента.Выбрать();
		НайденЗаказ = Ложь;
		
		Пока ЗаказыКлиентов.Следующий() Цикл
			// Проверяем, соответствует ли текущий заказ нужному
			Если ЗаказыКлиентов.Ссылка = Заказ Тогда
				НайденЗаказ = Истина;
				ЗакПокРек = ЗаказыКлиентов.ПолучитьОбъект();
				
				// Проверяем статус заказа
				// Переходим к проверке оплат
				ОплатыКлиентов = Документы.Оплата.Выбрать();
				НайденаОплата = Ложь;
				
				Пока ОплатыКлиентов.Следующий() Цикл
					Если ОплатыКлиентов.Заказ = Заказ Тогда
						НайденаОплата = Истина;
						ОплКлРек = ОплатыКлиентов.ПолучитьОбъект();
						
						Если ОплКлРек.Проведен = Ложь Тогда
							Сообщить("Документ не может быть проведен, т.к товар еще не оплачен.");
							Отказ = Истина;
							Возврат;
						КонецЕсли;
						Прервать; // Оплата найдена, выходим из цикла
					КонецЕсли;
				КонецЦикла;
				
				// Если оплата не найдена, сообщаем об этом
				Если Не НайденаОплата Тогда
					Сообщить("Документ не может быть проведен, т.к товар еще не оплачен.");
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				
				// Обновляем статус заказа
				ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.Выдан;
				ЗакПокРек.ДатаВыдачи = Дата;
				ЗакПокРек.Записать();
				Прервать; // Заказ найден и обработан, выходим из цикла
			КонецЕсли;
		КонецЦикла;
		
		// Если заказ не найден, выводим сообщение
		Если Не НайденЗаказ Тогда
			Сообщить("Документ не найден.");
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли ВидНакладной = Перечисления.ВидыНакладной.Приходная Тогда
		
		// регистр ОстаткиНоменклатуры приход
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		Для каждого ТекСтрокаСведения Из Сведения Цикл
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;   
			Движение.ITСервис = ITСервис;             
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаСведения.Название;
			Движение.Количество = ТекСтрокаСведения.Количество;  
			Движение.Себестоимость = ТекСтрокаСведения.Сумма;
		КонецЦикла;
		
		// регистр Поставки Приход
		Движения.Поставки.Записывать = Истина;
		Для Каждого ТекСтрокаСведения Из Сведения Цикл
			Движение = Движения.Поставки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ITСервис = ITСервис;
			Движение.Поставщик = Контрагент;  
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаСведения.Название;
			Движение.Цена = ТекСтрокаСведения.Цена;
			Движение.Количество = ТекСтрокаСведения.Количество;
			Движение.Сумма = ТекСтрокаСведения.Сумма;
		КонецЦикла;                 
		
		// регистр ДвиженияДенежныхСредств Приход
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ITСервис = ITСервис;
		Если СпособОплаты = Перечисления.СпособыОплаты.Наличные Тогда
			Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Иначе
			Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
		КонецЕсли;
		Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставок;
		Движение.СуммаРасход = Сумма;	
	КонецЕсли;
	
КонецПроцедуры

