
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	 // Проверяем, есть ли строки в табличной части "Описание"
    Если Объект.Описание.Количество() > 0 Тогда
        // Получаем последнюю строку табличной части
        ПоследняяСтрока = Объект.Описание[Объект.Описание.Количество() - 1];
        
        // Присваиваем значение реквизита "ЗаработнаяПлата" текущему объекту
        Объект.ТекущаяЗаработнаяПлата = ПоследняяСтрока.ЗаработнаяПлата;
    КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)      
	
	// Проверяем, есть ли строки в табличной части "Описание"
    Если Объект.Описание.Количество() > 0 Тогда
        // Получаем последнюю строку табличной части
        ПоследняяСтрока = Объект.Описание[Объект.Описание.Количество() - 1];
        
        // Присваиваем значение реквизита "ЗаработнаяПлата" текущему объекту
        Объект.ТекущаяЗаработнаяПлата = ПоследняяСтрока.ЗаработнаяПлата;
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЗаработнаяПлатаПриИзменении(Элемент)
	
	// Проверяем, есть ли строки в табличной части "Описание"
    Если Объект.Описание.Количество() > 0 Тогда
        // Получаем последнюю строку табличной части
        ПоследняяСтрока = Объект.Описание[Объект.Описание.Количество() - 1];
        
        // Присваиваем значение реквизита "ЗаработнаяПлата" текущему объекту
        Объект.ТекущаяЗаработнаяПлата = ПоследняяСтрока.ЗаработнаяПлата;
	КонецЕсли;
	
КонецПроцедуры


