
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиРесурсов Приход
	Движения.ОстаткиРесурсов.Записывать = Истина;
	Для Каждого ТекСтрокаСведения Из Сведения Цикл
		Движение = Движения.ОстаткиРесурсов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ТипРесурса = Тип;
		Движение.Название = ТекСтрокаСведения.Название;
		Движение.Ресторан = Ресторан;
		Движение.Количество = ТекСтрокаСведения.Количество;
	КонецЦикла;

	// регистр СтоимостьРесурсов Расход
	//Движения.СтоимостьРесурсов.Записывать = Истина;
	//Для Каждого ТекСтрокаСведения Из Сведения Цикл
	//	Движение = Движения.СтоимостьРесурсов.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.ТипРесурса = Тип;
	//	Движение.Название = ТекСтрокаСведения.Название;
	//	Движение.Ресторан = Ресторан;       
	//	Движение.Поставщик = Поставщик;
		//Движение.Стоимость = ТекСтрокаСведения.Сумма;
	//КонецЦикла;

	// регистр Поставки Приход
	Движения.Поставки.Записывать = Истина;
	Для Каждого ТекСтрокаСведения Из Сведения Цикл
		Движение = Движения.Поставки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;  
		Движение.Период = Дата; 
		Движение.Ресторан = Ресторан;
		Движение.Поставщик = Поставщик;
		Движение.ТипРесурса = Тип;
		Движение.Название = ТекСтрокаСведения.Название;
		Движение.Количество = ТекСтрокаСведения.Количество;
		Движение.Сумма = ТекСтрокаСведения.Сумма;
	КонецЦикла;   
	
	// регистр ДвиженияДенежныхСредств
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Ресторан = Ресторан;
		Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставок;      
		Движение.ТипДенежныхСредств = Оплата;
		Движение.СуммаРасход = Сведения.Итог("Сумма");     

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
