#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
		
		 // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды       
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
КонецПроцедуры                    


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда) 
	ЗаполнитьНаСервере();   
	
   КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Сотрудники.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЗарплатаОстатки.СуммаОстаток, 0) КАК Сумма,
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
		|		ПО Сотрудники.Должность = Должности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Зарплата.Остатки(
		|				&Дата,
		|				Ресторан = &Ресторан
		|					И Месяц = &Месяц) КАК ЗарплатаОстатки
		|		ПО Сотрудники.Ссылка = ЗарплатаОстатки.Сотрудник
		|ГДЕ
		|	Сотрудники.Ресторан = &Ресторан";
	
   	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ресторан", Объект.Ресторан);
	Запрос.УстановитьПараметр("Месяц", Объект.Месяц);     
	РезультатЗапроса = Запрос.Выполнить();
	                                                     
	Выборка = РезультатЗапроса.Выбрать();
	
    Пока Выборка.Следующий() Цикл 
		СтрокаТЧ = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка); 
		
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	ДолжностиОписание.ЗаработнаяПлата КАК ЗаработнаяПлата
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Должности.Описание КАК ДолжностиОписание
		|		ПО ДолжностиОписание.Ссылка = Сотрудники.Должность
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
			
	Запрос2.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
	РезультатЗапроса2 = Запрос2.Выполнить().Выбрать();
		
		Если РезультатЗапроса2.Следующий() Тогда
			СтрокаТЧ.ЗаработнаяПлата = РезультатЗапроса2.ЗаработнаяПлата;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура СотрудникиАктивенПриИзменении(Элемент)          
	
	ТекСтрокаСотрудники = Элементы.Сотрудники.ТекущиеДанные;
	
	Если ТекСтрокаСотрудники.Оклад Тогда
		ТекСтрокаСотрудники.Сумма = ТекСтрокаСотрудники.Сумма + ТекСтрокаСотрудники.ЗаработнаяПлата;
	Иначе
		ТекСтрокаСотрудники.Сумма = ТекСтрокаСотрудники.Сумма - ТекСтрокаСотрудники.ЗаработнаяПлата;
	КонецЕсли;
КонецПроцедуры

// Объект.Сотрудники.Очистить();

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ЗарплатаОстатки.Сотрудник КАК Сотрудник,
//		|	ЗарплатаОстатки.СуммаОстаток КАК Сумма
//		|ИЗ
//		|	РегистрНакопления.Зарплата.Остатки(
//		|			&Дата,
//		|			Ресторан = &Ресторан
//		|				И Месяц = &Месяц) КАК ЗарплатаОстатки";	
//	
//	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
//	Запрос.УстановитьПараметр("Ресторан", Объект.Ресторан);
//	Запрос.УстановитьПараметр("Месяц", Объект.Месяц);     
//	
//	РезультатЗапроса = Запрос.Выполнить();
	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл 
//		СтрокаТЧ = Объект.Сотрудники.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);      
//		
//	Запрос2 = Новый Запрос;
//		Запрос2.Текст = 
//			"ВЫБРАТЬ
//			|	ДолжностиОписание.ЗаработнаяПлата КАК ЗаработнаяПлата
//			|ИЗ
//			|	Справочник.Сотрудники КАК Сотрудники
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Должности.Описание КАК ДолжностиОписание
//			|		ПО ДолжностиОписание.Ссылка = Сотрудники.Должность
//			|ГДЕ
//			|	Сотрудники.Ссылка = &Сотрудник";
//			
//		Запрос2.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
//		РезультатЗапроса2 = Запрос2.Выполнить().Выбрать();
		
//		Если РезультатЗапроса2.Следующий() Тогда
//			СтрокаТЧ.ЗаработнаяПлата = РезультатЗапроса2.ЗаработнаяПлата;
//		КонецЕсли;
//	КонецЦикла;


