	Процедура ОбработкаПроведения(Отказ, Режим)    
		
	// регистр Поставки 
	Движения.Поставки.Записывать = Истина;
	Для Каждого ТекСтрокаСведения Из Сведения Цикл
		Движение = Движения.Поставки.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.ВидНакладной = ВидНакладной;
		Движение.Название = ТекСтрокаСведения.Название;  
		Движение.Склад = Склад;
		Движение.Сумма = ТекСтрокаСведения.Сумма;
		Движение.Количество = ТекСтрокаСведения.Количество; 
		Движение.Вес = ТекСтрокаСведения.ОбщийВес;
	КонецЦикла;

	// регистр ДвиженияДенежныхСредств Приход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Для Каждого ТекСтрокаСведения Из Сведения Цикл
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ТипДенежныхСредств = Оплата;  
		Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставок;
		Движение.СуммаРасход = ТекСтрокаСведения.Сумма;     
		Если Оплата = Перечисления.СпособыОплаты.Безналичный Тогда
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
	Иначе
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;      
	КонецЕсли;
	КонецЦикла;

	// регистр ОстаткиЖивотных Приход
	Движения.ОстаткиЖивотных.Записывать = Истина;
	Для Каждого ТекСтрокаСведения Из Сведения Цикл
		Движение = Движения.ОстаткиЖивотных.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата; 
		Движение.Склад = Склад;
		Движение.Название = ТекСтрокаСведения.Название;
		Движение.Количество = ТекСтрокаСведения.Количество;
	КонецЦикла;	
		
КонецПроцедуры
