Функция АктуальнаяЦенаУслуг(АктуальнаяДата, ЭлементУслуга) Экспорт
// Создать вспомогательный объект "Отбор".
Отбор = Новый Структура("Услуга", ЭлементУслуга);
// Получить актуальные значения ресурсов регистра.
ЗначенияРесурсов = РегистрыСведений.ЦеныУслуг.ПолучитьПоследнее(АктуальнаяДата, Отбор);
Возврат ЗначенияРесурсов.Цена;
КонецФункции        

Функция АктуальнаяЦенаМеню(АктуальнаяДата, ЭлементМеню) Экспорт
// Создать вспомогательный объект "Отбор".
Отбор = Новый Структура("Меню", ЭлементМеню);
// Получить актуальные значения ресурсов регистра.
ЗначенияРесурсов = РегистрыСведений.ЦеныМеню.ПолучитьПоследнее(АктуальнаяДата, Отбор);
Возврат ЗначенияРесурсов.Цена;
 КонецФункции 