
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Оплата.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	Оплата.Номер КАК Номер,
	|	Оплата.Дата КАК Дата,
	|	Оплата.ITСервис КАК ITСервис,
	|	Оплата.Контрагент КАК Контрагент,
	|	Оплата.СпособОплаты КАК Оплата,
	|	Оплата.Сумма КАК Сумма,
	|	Оплата.Заказ.Номер КАК ЗаказНомер,
	|	Оплата.Заказ.Дата КАК ЗаказДата,
	|	Оплата.Заказ.СоставЗаказа.(
	|		Ссылка КАК ЗаказСсылка,
	|		НомерСтроки КАК ЗаказНомерСтроки,
	|		Название КАК ЗаказНазвание,
	|		Количество КАК ЗаказКоличество,
	|		Цена КАК ЗаказЦена,
	|		Сумма КАК ЗаказСумма
	|	) КАК Заказ,
	|	Оплата.Заказ.Дата КАК ЗаказУслугиДата,
	|	Оплата.Заказ.Номер КАК ЗаказУслугиНомер,
	|	Оплата.Заказ.ПредоставляемыеУслуги.(
	|		Ссылка КАК УслугаСсылка,
	|		НомерСтроки КАК УслугаНомерСтроки,
	|		Услуга КАК УслугаНазвание,
	|		Количество КАК УслугаКоличество,
	|		Цена КАК УслугаЦена,
	|		Сумма КАК УслугаСумма
	|	) КАК ЗаказУслуг,
	|	Оплата.ITСервис.Адрес КАК Адрес,
	|	Оплата.ITСервис.Телефон КАК Телефон
	|ИЗ
	|	Документ.Оплата КАК Оплата
	|ГДЕ
	|	Оплата.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");             
	ОбластьПодзаголовок = Макет.ПолучитьОбласть("Подзаголовок");
	ОбластьCоставЗаказаШапка = Макет.ПолучитьОбласть("СоставЗаказаШапка");  
	ОбластьCоставЗаказа = Макет.ПолучитьОбласть("СоставЗаказа");   
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги"); 
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");      	
	ТабДок.Очистить();

		ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;  
		Если Выборка.ЗаказНомер = Неопределено Тогда
			Заказ = Выборка.ЗаказУслугиНомер; 
			ДатаЗаказа = Выборка.ЗаказУслугиДата;   
		Иначе 
			Заказ = Выборка.ЗаказНомер;
			ДатаЗаказа = Выборка.ЗаказДата;
		КонецЕсли;                    
		ОбластьЗаголовок.Параметры.Номер = Номер; 
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ОбластьЗаголовок.Параметры.НомерЗаказа = Заказ;
		ОбластьЗаголовок.Параметры.ДатаЗаказа = ДатаЗаказа;
		ТабДок.Вывести(ОбластьЗаголовок);     
		ОбластьПодзаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПодзаголовок);
        СуммаИтог = 0;           
		ЕСЛИ НЕ Выборка.Заказ.Пустой() Тогда
			ТабДок.Вывести(ОбластьCоставЗаказаШапка);
			ВыборкаЗаказ = Выборка.Заказ.Выбрать();
			Пока ВыборкаЗаказ.Следующий() Цикл
				ОбластьCоставЗаказа.Параметры.Заполнить(ВыборкаЗаказ);
				ТабДок.Вывести(ОбластьCоставЗаказа, ВыборкаЗаказ.Уровень());
				СуммаИтог = СуммаИтог + ВыборкаЗаказ.ЗаказСумма;
			КонецЦикла;
		КонецЕсли;
		ЕСЛИ НЕ Выборка.ЗаказУслуг.Пустой() Тогда
			ТабДок.Вывести(ОбластьУслугиШапка);
			ВыборкаУслуги = Выборка.ЗаказУслуг.Выбрать();
			Пока ВыборкаУслуги.Следующий() Цикл
				ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
				ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
				СуммаИтог = СуммаИтог + ВыборкаУслуги.УслугаСумма;
			КонецЦикла;
		КонецЕсли;         
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
  		ОбластьПодвал.Параметры.Ответственный = ТекПользователь;
		ОбластьПодвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПодвал);
		ВставлятьРазделительСтраниц = Истина;  
	КонецЦикла;
		//}}
КонецПроцедуры
