
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		ITСервис = ДанныеЗаполнения.ITСервис;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Сумма = ДанныеЗаполнения.СоставЗаказа.Итог("Сумма");
		СпособОплаты = ДанныеЗаполнения.СпособОплаты;
		Заказ = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОказаниеУслуги") Тогда
		// Заполнение шапки
		ITСервис = ДанныеЗаполнения.ITСервис;
		Контрагент = ДанныеЗаполнения.Контрагент;
		СпособОплаты = ДанныеЗаполнения.СпособОплаты;
		Заказ = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.Сумма;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ЗаказыПокупателей = Документы.ЗаказКлиента.Выбрать();
	Пока ЗаказыПокупателей.Следующий() Цикл         
		Если ЗаказыПокупателей.Ссылка = Заказ Тогда
			ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект();
	// регистр ДвиженияДенежныхСредств Приход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Движение = Движения.ДвиженияДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;                            
	Движение.ITСервис = ITСервис;
	Если СпособОплаты = Перечисления.СпособыОплаты.Наличные ТОГДА
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные; 
	Иначе
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;  
	КонецЕсли;             
			Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтКлиента;
			Движение.СуммаПриход = Сумма;   
			Если ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.Новый ИЛИ ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.ОплатаОтменена
				Тогда
				ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.Оплачен;    
				ЗакПокРек.Записать();
			ЗакПокРек.Записать(РежимЗаписиДокумента.Проведение); 
			Иначе
				Возврат;
			КонецЕсли;  
		КонецЕсли;
	КонецЦикла;     
	 
	
	ОказаниеУслуги = Документы.ОказаниеУслуги.Выбрать();
	Пока ОказаниеУслуги.Следующий() Цикл
		Если ОказаниеУслуги.Ссылка = Заказ Тогда
			ОказУсРек = ОказаниеУслуги.ПолучитьОбъект();
			// регистр ДвиженияДенежныхСредств Приход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Движение = Движения.ДвиженияДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;                            
	Движение.ITСервис = ITСервис;
	Если СпособОплаты = Перечисления.СпособыОплаты.Наличные ТОГДА
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные; 
	Иначе
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;  
	КонецЕсли;
	Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтКлиента;
			Движение.СуммаПриход = Сумма;
		КонецЕсли; 
	КонецЦикла;
		

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 
