Функция СведенияОВнешнейОбработке() Экспорт   
	
	ПараметрыРегистрации = Новый Структура;

	ПараметрыРегистрации.Вставить("Назначение", "Документ.ИТ_ПояснительнаяЗаписка");    
	
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(); 
	
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();

    ПараметрыРегистрации.Наименование = НСтр("ru='Отчет_ПояснительныеЗапискиЗаДень'");

    ПараметрыРегистрации.БезопасныйРежим = Ложь;

    ПараметрыРегистрации.Версия = "01.10.2025";

    ПараметрыРегистрации.Информация = НСтр("ru='Ведомость по Отчет_ПояснительныеЗапискиЗаДень товарам'"); 
	
    Команда = ПараметрыРегистрации.Команды.Добавить();

    Команда.Идентификатор = "Отчет пояснительные записки за день";

    Команда.Представление = "Отчет пояснительные записки за день";

    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();

    Возврат ПараметрыРегистрации;
КонецФункции
