&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьСезонНоменклатурыНаСервере();
КонецПроцедуры   

&НаСервереБезКонтекста
Процедура ЗаполнитьСезонНоменклатурыНаСервере()
    
    Выборка = Справочники.Номенклатура.Выбрать();
    Генератор = Новый ГенераторСлучайныхЧисел();
	
    Пока Выборка.Следующий() Цикл
        Элемент = Выборка.ПолучитьОбъект();
        
        Случайное = Генератор.СлучайноеЧисло(0, 2);
        Случайное = Цел(Случайное);
        Если Случайное = 0 Тогда
            Элемент.Сезон = Перечисления.ИТ_Сезон.Лето;
        ИначеЕсли Случайное = 1 Тогда
            Элемент.Сезон = Перечисления.ИТ_Сезон.Зима;  
		Иначе
            Элемент.Сезон = Неопределено;        
		КонецЕсли;
        
        Элемент.Записать();
    КонецЦикла;
    
    Сообщить("Заполнение выполнено!");
    
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьНаСервере()
	
	 Выборка = Справочники.Номенклатура.Выбрать();   
	 
     Пока Выборка.Следующий() Цикл
        Элемент = Выборка.ПолучитьОбъект();
        
        Элемент.Сезон = Неопределено;        
        
        Элемент.Записать();
    КонецЦикла;
    
    Сообщить("Очистка завершена!");
КонецПроцедуры
