
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Заказы 
	Движения.Заказы.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл
		Движение = Движения.Заказы.Добавить();
		Движение.Период = Дата; 
		Если Статус = Перечисления.СтатусыЗаказов.Новый Тогда
			Движение.СтатусЗаказа = Перечисления.СтатусыЗаказов.Новый;
		ИначеЕсли Статус = Перечисления.СтатусыЗаказов.Выполнен Тогда     
			Движение.СтатусЗаказа = Перечисления.СтатусыЗаказов.Выполнен;  
		Иначе
			Движение.СтатусЗаказа = Перечисления.СтатусыЗаказов.Выдан; 
		КонецЕсли;       
		    Движение.Заказчик = Заказчик;
			Движение.Товар = ТекСтрокаПереченьТоваров.Название;
			Движение.Размер = ТекСтрокаПереченьТоваров.Размер;
			Движение.Цвет = ТекСтрокаПереченьТоваров.Цвет;
			Движение.Цена = ТекСтрокаПереченьТоваров.Цена;
			Движение.Количество = ТекСтрокаПереченьТоваров.Количество;
			Движение.Сумма = ТекСтрокаПереченьТоваров.Сумма;      
		КонецЦикла;    
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
