#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
		
		 // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды       
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
КонецПроцедуры                    


#КонецОбласти 


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКОплате(Команда)
	
	ДокументЗаписан = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);   
	Иначе 
		ДокументЗаписан = Истина;
	КонецЕсли;
	
	Если ДокументЗаписан Тогда
	СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.Оплата.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры 

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


&НаКлиенте
Процедура СоставЗаказаКоличествоПриИзменении(Элемент)
СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаЦенаПриИзменении(Элемент)
СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);	
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаМенюПриИзменении(Элемент)
// Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
// Установить цену.
СтрокаТабличнойЧасти.Цена = МодульАвтоЦена.АктуальнаяЦенаМеню( 

Объект.Дата, СтрокаТабличнойЧасти.Меню);
// Пересчитать сумму строки
РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	// Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
// Установить цену.
СтрокаТабличнойЧасти.Сумма = МодульАвтоЦена.АктуальнаяЦенаУслуг( 

Объект.Дата, СтрокаТабличнойЧасти.Услуга);

КонецПроцедуры

