
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Попытка
		Оповещение = Новый ОписаниеОповещения("ЗагрузкаДанныхИзФайла", ЭтотОбъект);	
		НачатьПомещениеФайлаНаСервер(Оповещение,,,,,УникальныйИдентификатор);
	Исключение
		ПредупреждениеАсинх("Нет доступа к файлу. Проверьте, не открыт ли он в другом окне.");
	КонецПопытки;	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузкаДанныхИзФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла <> Неопределено Тогда
		ПутьКФайлу = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
	КонецЕсли;
	
КонецПроцедуры      

&НаКлиенте
Процедура ИмпортТиповПродукции(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ИмпортТиповПродукцииНаСервере(ТабДок, ПутьКФайлу);  
	ПредупреждениеАсинх("Загрузка завершена");		
	
КонецПроцедуры

&НаСервере
Процедура ИмпортТиповПродукцииНаСервере(ТабДок, ПутьКФайлу)
	
	ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область("Product_type_import"));
	ПостроительЗапроса.Выполнить();
	
	ТаблицаТиповПродукции = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого СтрокаТиповПродукции Из ТаблицаТиповПродукции Цикл     
		
		Если Справочники.ТипыПродукции.НайтиПоНаименованию(СтрокаТиповПродукции[0]) = Справочники.ТипыПродукции.ПустаяСсылка() Тогда
			НовыйТипПродукции = Справочники.ТипыПродукции.СоздатьЭлемент();	
			НовыйТипПродукции.Наименование = СтрокаТиповПродукции[0]; 
			НовыйТипПродукции.КоэффициентТипаПродукции = СтрокаТиповПродукции[1];
			НовыйТипПродукции.Записать();	
		Иначе
			Сообщить("ТипПродукции с наименованием: " + СтрокаТиповПродукции[0] + " уже занесен в справочник.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортЦехов(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ИмпортЦеховНаСервере(ТабДок, ПутьКФайлу);  
	ПредупреждениеАсинх("Загрузка завершена");	
	
КонецПроцедуры

&НаСервере
Процедура ИмпортЦеховНаСервере(ТабДок, ПутьКФайлу)
	
	ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область("Workshops_import"));
	ПостроительЗапроса.Выполнить();
	
	ТаблицаЦехов = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого СтрокаЦехов Из ТаблицаЦехов Цикл     
		
		Если Справочники.Цехи.НайтиПоНаименованию(СтрокаЦехов[0]) = Справочники.Цехи.ПустаяСсылка() Тогда
			
			НовыйЦех = Справочники.Цехи.СоздатьЭлемент();  
			
			Если СтрокаЦехов[1] = "Проектирование" Тогда
				ТипЦехаИзстроки = Перечисления.ТипыЦехов.Проектирование;
			ИначеЕсли
				СтрокаЦехов[1] = "Обработка" Тогда
				ТипЦехаИзстроки = Перечисления.ТипыЦехов.Обработка;
			ИначеЕсли
				СтрокаЦехов[1] = "Сушка" Тогда
				ТипЦехаИзстроки = Перечисления.ТипыЦехов.Сушка;
			ИначеЕсли
				СтрокаЦехов[1] = "Сборка" Тогда
				ТипЦехаИзстроки = Перечисления.ТипыЦехов.Сборка;
			Иначе
				Сообщить("Тип цеха: " + СтрокаЦехов[1] + " не определен в качестве перечисления.");
			КонецЕсли;
			НовыйЦех.Наименование = СтрокаЦехов[0];  
			НовыйЦех.ТипЦеха = ТипЦехаИзстроки;
			НовыйЦех.КоличествоЧеловекДляПроизводства = СтрокаЦехов[2];
			НовыйЦех.Записать();
		Иначе
			Сообщить("Цех с наименованием: " + СтрокаЦехов[0] + " уже занесен в справочник.");  
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортТиповМатериалов(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ИмпортТиповМатериаловНаСервере(ТабДок, ПутькФайлу);   
	ПредупреждениеАсинх("Загрузка завершена");
	
КонецПроцедуры

&НаСервере
Процедура ИмпортТиповМатериаловНаСервере(ТабДок, ПутьКФайлу)
	
	ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область("Material_type_import"));
	ПостроительЗапроса.Выполнить();
	
	ТаблицаТиповМатериалов = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого СтрокаТиповМатериалов Из ТаблицаТиповМатериалов Цикл     
		
		Если Справочники.ТипыМатериалов.НайтиПоНаименованию(СтрокаТиповМатериалов[0]) = Справочники.ТипыМатериалов.ПустаяСсылка() Тогда	
			НовыйТипМатериала = Справочники.ТипыМатериалов.СоздатьЭлемент();  	
			НовыйТипМатериала.Наименование = СтрокаТиповМатериалов[0];  
			НовыйТипМатериала.ПроцентПотерьСырья = Число(СтрокаТиповМатериалов[1]*100);
			НовыйТипМатериала.Записать();
		Иначе
			Сообщить("Тип материала с наименованием: " + СтрокаТиповМатериалов[0] + " уже занесен в справочник."); 
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортПродукции(Команда) 
	
	ТабДок = Новый ТабличныйДокумент;
	ИмпортПродукцииНаСервере(ТабДок, ПутьКФайлу);      
	ПредупреждениеАсинх("Загрузка завершена");
	
КонецПроцедуры

&НаСервере
Процедура ИмпортПродукцииНаСервере(ТабДок, ПутьКФайлу)
	
	ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область("Products_import"));
	ПостроительЗапроса.Выполнить();
	
	ТаблицаПродукции = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого СтрокаТаблицыПродукции Из ТаблицаПродукции Цикл     
		
		Если Справочники.Продукция.НайтиПоНаименованию(СтрокаТаблицыПродукции[1]) = Справочники.Продукция.ПустаяСсылка() Тогда
			НоваяПродукция = Справочники.Продукция.СоздатьЭлемент();  
			НоваяПродукция.ТипПродукции = Справочники.ТипыПродукции.НайтиПоНаименованию(СтрокаТаблицыПродукции[0]); 
			НоваяПродукция.Наименование = СтрокаТаблицыПродукции[1];                   
			НоваяПродукция.Артикул = СтрокаТаблицыПродукции.Артикул;
			НоваяПродукция.МинимальнаяСтоимостьДляПартнера = СтрокаТаблицыПродукции[3];
			НоваяПродукция.ОсновнойМатериал = Справочники.ТипыМатериалов.НайтиПоНаименованию(СтрокаТаблицыПродукции[4]);
			НоваяПродукция.Записать();	
		Иначе
			Сообщить("Продукция с наименованеим: " + СтрокаТаблицыПродукции[1] + " уже занесена в справочник.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортПроизводств(Команда) 
	
	ТабДок = Новый ТабличныйДокумент;
	ИмпортПроизводствНаСервере(ТабДок, ПутьКФайлу);      
	ПредупреждениеАсинх("Загрузка завершена");        
	
КонецПроцедуры

&НаСервере
Процедура ИмпортПроизводствНаСервере(ТабДок, ПутьКФайлу)
	
	ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область("Product_workshops_import"));
	ПостроительЗапроса.Выполнить();  
	
	ТаблицаПроизводства = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого СтрокаТаблицыПроизводства из ТаблицаПроизводства Цикл
		
		Если Справочники.Продукция.НайтиПоНаименованию(СтрокаТаблицыПроизводства[0]) = Справочники.Продукция.ПустаяСсылка() Тогда
			Сообщить("Продукция с наименованием: " + СтрокаТаблицыПроизводства[0] + " не занесена в справочник, создание документа невозможно.");  
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Если Справочники.Цехи.НайтиПоНаименованию(СтрокаТаблицыПроизводства[1]) = Справочники.Цехи.ПустаяСсылка() Тогда
			Сообщить("Цех с наименованием: " + СтрокаТаблицыПроизводства[1] + " не занесен в справочник, создание документа невозможно."); 
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		НовоеПроизводство = Документы.Производство.СоздатьДокумент();
		НовоеПроизводство.Дата = ТекущаяДата();
		НовоеПроизводство.Цех = Справочники.Цехи.НайтиПоНаименованию(СтрокаТаблицыПроизводства[1]);
		НовоеПроизводство.Продукт = Справочники.Продукция.НайтиПоНаименованию(СтрокаТаблицыПроизводства[0]);
		НовоеПроизводство.ВремяИзготовления = СтрокаТаблицыПроизводства[2];
		НовоеПроизводство.Записать(РежимЗаписиДокумента.Проведение);	
	КонецЦикла;	  
	
КонецПроцедуры



