&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновки =  ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ДанныеРасшифровкиКомпоновкиДанных = Новый ДанныеРасшифровкиКомпоновкиДанных; 
	
    КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновки,
								Отчет.КомпоновщикНастроек.ПолучитьНастройки(), 
								ДанныеРасшифровкиКомпоновкиДанных);
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,, ДанныеРасшифровкиКомпоновкиДанных, Истина);
    ПроцессорВыводаРезультата = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	РезультатОтчета = Новый ТабличныйДокумент;  
	
    ПроцессорВыводаРезультата.УстановитьДокумент(РезультатОтчета);
    ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных);
		
	ЗаполнитьДиаграммы(РезультатОтчета, ДанныеРасшифровкиКомпоновкиДанных);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммы(РезультатОтчета, ДанныеРасшифровкиКомпоновкиДанных)
	
	
	ДиаграммаПоПериодам = РезультатОтчета.Рисунки[0].Объект;
	
	Если ДанныеРасшифровкиПоПериодам = "" Тогда
		ДанныеРасшифровкиПоПериодам = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, 
																	УникальныйИдентификатор);
	Иначе																		   
	 	ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, ДанныеРасшифровкиПоПериодам);
	КонецЕсли;
	
	
	ДиаграммаПоЗаказам = РезультатОтчета.Рисунки[1].Объект;
	
	Если ДанныеРасшифровкиПоЗаказам = "" Тогда
		ДанныеРасшифровкиПоЗаказам = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, 
																   УникальныйИдентификатор);
	Иначе																		   
	 	ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, ДанныеРасшифровкиПоЗаказам);
	КонецЕсли;
		

	
	ДиаграммаПоРесторанам = РезультатОтчета.Рисунки[2].Объект;
	
	Если ДанныеРасшифровкиПоРесторанам = "" Тогда
		ДанныеРасшифровкиПоРесторанам = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, 
																   УникальныйИдентификатор);
	Иначе																		   
	 	ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, ДанныеРасшифровкиПоРесторанам);
	КонецЕсли;    
КонецПроцедуры
	
	
&НаСервере
Функция РасшифровкаВЗначение(Расшифровка, ДанныеРасшифровкиКомпоновкиДанных)
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		ЭлементРасшифровки = ДанныеРасшифровкиКомпоновкиДанных.Элементы[Расшифровка];
		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
				Возврат Поле.Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ДиаграммаПоПериодамОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПоЗаказамОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры  
&НаКлиенте
Процедура ДиаграммаПоРесторанамОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

