

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//регистр Заказы
	Движения.Заказы.Записывать = Истина;
	Для Каждого ТекСтрокаСоставЗаказа Из СоставЗаказа Цикл
		Движение = Движения.Заказы.Добавить();
		Движение.Период = Дата;
		Движение.СоставЗаказа = ТекСтрокаСоставЗаказа.Меню;
		Движение.Клиент = Клиент;
		Движение.Ресторан = Ресторан;
		Движение.Количество = ТекСтрокаСоставЗаказа.Количество;
		Движение.Стоимость = ТекСтрокаСоставЗаказа.Сумма;
		Движение.Выручка = ТекСтрокаСоставЗаказа.Количество*ТекСтрокаСоставЗаказа.Цена;
	КонецЦикла;

	// регистр СтоимостьРесурсов Приход
	Движения.СтоимостьРесурсов.Записывать = Истина;
	Для Каждого ТекСтрокаСоставЗаказа Из СоставЗаказа Цикл
		Движение = Движения.СтоимостьРесурсов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ТипРесурса = ТипЗаказа;
		Движение.Название = ТекСтрокаСоставЗаказа.Меню;
		Движение.Ресторан = Ресторан;
		Движение.Стоимость = ТекСтрокаСоставЗаказа.Количество*ТекСтрокаСоставЗаказа.Цена;
	КонецЦикла;

	// регистр ОстаткиРесурсов Расход
	Движения.ОстаткиРесурсов.Записывать = Истина;
	Для Каждого ТекСтрокаСоставЗаказа Из СоставЗаказа Цикл 
    Для Каждого СтрокаТабЧ Из ТекСтрокаСоставЗаказа.Меню.Состав Цикл
        Движение = Движения.ОстаткиРесурсов.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;                           
		Движение.ТипРесурса = СтрокаТабЧ.Тип;
		Движение.Название = СтрокаТабЧ.Ингредиент;
        Движение.Ресторан = Ресторан;
        Движение.Количество = СтрокаТабЧ.Количество;
	КонецЦикла;                                        
КонецЦикла; 

	// регистр РегистрУслуг 
	Движения.РегистрУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.РегистрУслуг.Добавить();
		Движение.Период = Дата;   
		Движение.Ресторан = Ресторан;
		Движение.Клиент = Клиент;
		Движение.Сотрудник = ТекСтрокаУслуги.Сотрудник;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
	КонецЦикла;
    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
  Если Услуги.Количество() > 0 Тогда
	Движения.Зарплата.Записывать = Истина;
	Для каждого  ТекСтрокаУслуги из Услуги Цикл
    Если ТекСтрокаУслуги.Сотрудник.Пустая() Тогда
        Продолжить;      
	Иначе
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцентЗарплатыУслуги.Процент КАК Процент,
		|	ОбработкаЗаказаУслуги.Сотрудник.Ссылка КАК СотрудникСсылка
		|ИЗ
		|	РегистрСведений.ПроцентЗарплатыУслуги КАК ПроцентЗарплатыУслуги,
		|	Документ.ОбработкаЗаказа.Услуги КАК ОбработкаЗаказаУслуги
		|ГДЕ
		|	ПроцентЗарплатыУслуги.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", ТекСтрокаУслуги.Сотрудник);
	Процент = 0;
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Процент = Выборка.Процент;
	КонецЕсли; 
	//Регистр зарплата
	
	Движение = Движения.Зарплата.Добавить(); 
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Ресторан = Ресторан;
	Движение.Сотрудник = ТекСтрокаУслуги.Сотрудник;
	Движение.Месяц = НачалоМесяца(Дата);
	Движение.Сумма = ТекСтрокаУслуги.Сумма * Процент / 100; 	      
  КонецЕсли; 
 КонецЦикла;
КонецЕсли; 	 

КонецПроцедуры


//Запрос = Новый Запрос;
	//Запрос.Текст = 
		//"ВЫБРАТЬ
	//	|	ПроцентЗарплатыУслуги.Процент КАК Процент,
	//	|	ОбработкаЗаказаУслуги.Сотрудник.Ссылка КАК СотрудникСсылка
	//	|ИЗ
	//	|	РегистрСведений.ПроцентЗарплатыУслуги КАК ПроцентЗарплатыУслуги,
	//	|	Документ.ОбработкаЗаказа.Услуги КАК ОбработкаЗаказаУслуги
	//	|ГДЕ
	//	|	ПроцентЗарплатыУслуги.Сотрудник = &Сотрудник";


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ФормированиеЗаявки") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Ресторан = ДанныеЗаполнения.Ресторан;
		Заявка = ДанныеЗаполнения.Ссылка;
		Стол = ДанныеЗаполнения.Стол; 
		Заявка = ДанныеЗаполнения.Ссылка;
		ТЧ_Услуги = ЭтотОбъект.Услуги.Добавить();
		ТЧ_Услуги.Сотрудник = ДанныеЗаполнения.Сотрудник;
		ТЧ_Услуги.Сумма = ДанныеЗаполнения.Сумма;
	    ТЧ_Услуги.Услуга = ДанныеЗаполнения.Услуга;
		Для Каждого ТекСтрокаСоставЗаказа Из ДанныеЗаполнения.СоставЗаказа Цикл
			НоваяСтрока = СоставЗаказа.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСоставЗаказа.Количество;
			НоваяСтрока.Меню = ТекСтрокаСоставЗаказа.Меню;
			НоваяСтрока.Сумма = ТекСтрокаСоставЗаказа.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСоставЗаказа.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

