
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланПроизводства") Тогда
		// Заполнение шапки
		Заказ = ДанныеЗаполнения.Заказ;
		Для Каждого ТекСтрокаДвериКПроизводству Из ДанныеЗаполнения.ДвериКПроизводству Цикл
			НоваяСтрока = ПроизведенныеДвери.Добавить();
			НоваяСтрока.Количество = ТекСтрокаДвериКПроизводству.Количество;
			НоваяСтрока.Название = ТекСтрокаДвериКПроизводству.Название;
			НоваяСтрока.Размер = ТекСтрокаДвериКПроизводству.Размер;
			НоваяСтрока.Цвет = ТекСтрокаДвериКПроизводству.Цвет;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ЗаказыПокупателей = Документы.ЗаказПокупателя.Выбрать(); // Получение выборки всех документов "ЗаказПокупателя"
	Пока ЗаказыПокупателей.Следующий() Цикл // Цикл по всем заказам покупателей
		Если ЗаказыПокупателей.Ссылка = Заказ Тогда // Проверка, совпадает ли ссылка заказа с текущим документом
			ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект(); // Получение объекта заказа покупателя по текущей строке выборки
			ЗакПокРек.ДатаВыполнения = Дата; // Установка даты выполнения заказа
			ЗакПокРек.Статус = Перечисления.СтатусыЗаказов.Выполнен; // Установка статуса заказа на "Выполнен"
			ЗакПокРек.Записать(); // Сохранение изменений в объекте заказа
		КонецЕсли;                 
	КонецЦикла;      
	
	ЗакПокРек.Записать(РежимЗаписиДокумента.Проведение); // Сохранение заказа с указанием режима записи "Проведение"
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

