
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияЗаявок     
	Движения.ИсторияЗаявок.Записывать = Истина;        
	Если ТипЗаявки = Перечисления.ТипыЗаявок.Инцидент Тогда 
	Движение = Движения.ИсторияЗаявок.Добавить();
	Движение.Период = Дата;
	Движение.ITСервис = ITСервис;
	Движение.Контрагент = Контрагент;
	Движение.ТипЗаявки = Перечисления.ТипыЗаявок.Инцидент;
	Движение.Сумма = 0;
ИначеЕсли ТипЗаявки = Перечисления.ТипыЗаявок.Услуга Тогда
		Движение = Движения.ИсторияЗаявок.Добавить();
		Движение.Период = Дата;
		Движение.ITСервис = ITСервис;
		Движение.Контрагент = Контрагент;  
		Движение.ТипЗаявки = Перечисления.ТипыЗаявок.Услуга;
		Движение.Сумма = ПредоставлениеУслуг.Итог("Сумма");     
	КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДатаОкончания = Дата + Длительность * 3600;  
КонецПроцедуры