Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ИТ_ПояснительнаяЗаписка.ПолучитьМакет("Печать");  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИТ_ПояснительнаяЗаписка.Дата КАК Дата,
	|	ИТ_ПояснительнаяЗаписка.Номер КАК Номер,
	|	ИТ_ПояснительнаяЗаписка.ТекстЗаписки КАК ТекстЗаписки
	|ИЗ
	|	Документ.ИТ_ПояснительнаяЗаписка КАК ИТ_ПояснительнаяЗаписка
	|ГДЕ
	|	ИТ_ПояснительнаяЗаписка.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок.Очистить();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка           = Макет.ПолучитьОбласть("Шапка");
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Номер = Выборка.Номер;
		Шапка.Параметры.Дата  = Выборка.Дата;
		
		Если ЗначениеЗаполнено(Выборка.ТекстЗаписки) Тогда
			ФормДок  = Выборка.ТекстЗаписки.Получить();
			Элементы = ФормДок.ПолучитьЭлементы();
			
			Для Каждого Элемент Из Элементы Цикл
				
				Если ТипЗнч(Элемент) = Тип("ТекстФорматированногоДокумента") Тогда
					Шапка.Параметры.ТекстЗаписки = Элемент.Текст;
					
				ИначеЕсли ТипЗнч(Элемент) = Тип("КартинкаФорматированногоДокумента") Тогда
					Шапка.Рисунки.КартинкаТест.Картинка = Элемент.Картинка;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		ТабДок.Вывести(Шапка);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
