
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОказаниеУслуги.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =    
	"ВЫБРАТЬ
	|	ОказаниеУслуги.Номер КАК Номер,
	|	ОказаниеУслуги.Дата КАК Дата,
	|	ОказаниеУслуги.Контрагент КАК Контрагент,
	|	ОказаниеУслуги.Сотрудник КАК ОтветственноеЛицо,
	|	ОказаниеУслуги.ПредоставляемыеУслуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК ПредоставляемыеУслуги,
	|	ОказаниеУслуги.СпособОплаты КАК СпособОплаты,
	|	ОказаниеУслуги.ITСервис КАК ITСервис,
	|	ОказаниеУслуги.Сотрудник.Подпись КАК Подпись,
	|	ОказаниеУслуги.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.ОказаниеУслуги КАК ОказаниеУслуги
	|ГДЕ
	|	ОказаниеУслуги.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;   
		   
		Если НЕ Выборка.Подпись.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Подпись);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаПодпись = Новый Картинка(ДвоичныеДанные);
				Подвал.Рисунки.Подпись.Картинка = КартинкаПодпись;
			КонецЕсли;
		КонецЕсли;

		
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер; 
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ТабДок.Вывести(ОбластьЗаголовок);
        ТекПользователь = Выборка.ОтветственноеЛицо;
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
        СуммаИтог = 0;
		ТабДок.Вывести(ОбластьУслугиШапка);
		ВыборкаУслуги = Выборка.ПредоставляемыеУслуги.Выбрать();
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
			ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаУслуги.Сумма;
		КонецЦикла;
  		Подвал.Параметры.Ответственный = ТекПользователь;
		Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
