
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		ITСервис = ДанныеЗаполнения.ITСервис;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Заявка = ДанныеЗаполнения.Ссылка;    
		Сумма = ДанныеЗаполнения.ПредоставлениеУслуг.Итог("Сумма");
		Для Каждого ТекСтрокаПредоставлениеУслуг Из ДанныеЗаполнения.ПредоставлениеУслуг Цикл
			НоваяСтрока = ПредоставляемыеУслуги.Добавить();
			НоваяСтрока.Количество = ТекСтрокаПредоставлениеУслуг.Количество;
			НоваяСтрока.Сумма = ТекСтрокаПредоставлениеУслуг.Сумма;
			НоваяСтрока.Услуга = ТекСтрокаПредоставлениеУслуг.Услуга;
			НоваяСтрока.Цена = ТекСтрокаПредоставлениеУслуг.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр Услуги 
	Движения.Услуги.Записывать = Истина;
	Для Каждого ТекСтрокаПредоставляемыеУслуги Из ПредоставляемыеУслуги Цикл
		Движение = Движения.Услуги.Добавить();
		Движение.Период = Дата;
		Движение.ITСервис = ITСервис;
		Движение.Клиент = Контрагент;
		Движение.Сотрудник = Сотрудник;
		Движение.Услуга = ТекСтрокаПредоставляемыеУслуги.Услуга;
		Движение.Цена = ТекСтрокаПредоставляемыеУслуги.Цена;
		Движение.Количество = ТекСтрокаПредоставляемыеУслуги.Количество;
		Движение.Сумма = ТекСтрокаПредоставляемыеУслуги.Сумма;
	КонецЦикла;
	
	Движения.Зарплата.Записывать = Истина;
	Если Сотрудник.Пустая() Тогда
		Возврат;      
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслуги.Сотрудник КАК СотрудникСсылка,
		|	ПроцентЗарплатыУслуги.Процент КАК Процент
		|ИЗ
		|	Документ.ОказаниеУслуги КАК ОказаниеУслуги,
		|	РегистрСведений.ПроцентЗарплатыУслуги КАК ПроцентЗарплатыУслуги
		|ГДЕ
		|	ПроцентЗарплатыУслуги.Сотрудник = &Сотрудник";	
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Процент = 0;     
		СтандартныйПроцент = 5;
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Процент = Выборка.Процент;
		КонецЕсли; 
		//Регистр зарплата
		Движение = Движения.Зарплата.Добавить(); 
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ITСервис = ITСервис;
		Движение.Сотрудник = Сотрудник;
		Движение.Месяц = НачалоМесяца(Дата);     
		Если Процент <> 0 Тогда
			Движение.Сумма = Сумма * Процент / 100; 
		Иначе 
			Движение.Сумма = Сумма * СтандартныйПроцент / 100;  
		КонецЕсли;
	КонецЕсли; 	
	// регистр Зарплата Приход
	Движения.Зарплата.Записывать = Истина;
	Движение = Движения.Зарплата.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ITСервис = ITСервис;
	Движение.Сотрудник = Сотрудник;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
