
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Цена = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите цену";
		Сообщение.Поле = "Цена";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	ТекДата = НачалоДня(ТекущаяДата());          
	
	НаборЗаписей = РегистрыСведений.ЦеныУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекДата);  
	НаборЗаписей.Отбор.Ресторан.Установить(Объект.Ресторан.Ссылка);
  	НаборЗаписей.Отбор.Услуга.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	ЕстьИзменения = Ложь;
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекДата;    
		Запись.Ресторан = Объект.Ресторан.Ссылка;
		Запись.Услуга = ТекущийОбъект.Ссылка;
		Запись.Цена = Цена;  
		
		ЕстьИзменения = Истина;
	Иначе
		Запись = НаборЗаписей.Получить(0);
		Если Запись.Цена <> Цена Тогда
			ЕстьИзменения = Истина;
			Запись.Цена = Цена;
		КонецЕсли;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныУслугСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныУслуг.СрезПоследних(, Услуга = &Услуга) КАК ЦеныУслугСрезПоследних";
	
	Запрос.УстановитьПараметр("Услуга", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Цена = Выборка.Цена;
	КонецЕсли;
КонецПроцедуры
