
&НаКлиенте
Процедура Произвести(Команда)   

	ДокументЗаписан = Ложь; // Инициализация переменной, указывающей на статус сохранения документа
	Если Объект.Ссылка.Пустая() Тогда // Проверка, пустая ли ссылка на текущий документ
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение); // Создание структуры параметров записи с режимом "Проведение"
		ДокументЗаписан = Записать(ПараметрыЗаписи); // Попытка сохранить документ с заданными параметрами
	Иначе 
		ДокументЗаписан = Истина; // Если документ уже существует, то он считается записанным
	КонецЕсли;
	
	Если ДокументЗаписан Тогда // Проверка, был ли документ успешно записан
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка); // Создание структуры параметров с основанием, указывающим на текущий объект
		ОткрытьФорму("Документ.Производство.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); // Открытие формы документа "Производство" с указанными параметрами
	КонецЕсли;

КонецПроцедуры
