
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьОплатаЗаказа)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьОплатаЗаказа(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьОплатаЗаказа(ТабДок, ПараметрКоманды)
	Документы.Оплата.ПечатьОплатаЗаказа(ТабДок, ПараметрКоманды);
КонецПроцедуры
