
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОтрузкаПродукции.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтрузкаПродукции.ВидНакладной,
	|	ОтрузкаПродукции.Дата,
	|	ОтрузкаПродукции.Контрагент,
	|	ОтрузкаПродукции.Номер,
	|	ОтрузкаПродукции.Оплата,
	|	ОтрузкаПродукции.Склад,
	|	ОтрузкаПродукции.Накладная.(
	|		НомерСтроки,
	|		Продукт,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ОтрузкаПродукции КАК ОтрузкаПродукции
	|ГДЕ
	|	ОтрузкаПродукции.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНакладнаяШапка = Макет.ПолучитьОбласть("НакладнаяШапка");
	ОбластьНакладная = Макет.ПолучитьОбласть("Накладная");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
        СуммаИтог = 0;
		ТабДок.Вывести(ОбластьНакладнаяШапка);
		ВыборкаНакладная = Выборка.Накладная.Выбрать();
		Пока ВыборкаНакладная.Следующий() Цикл
			ОбластьНакладная.Параметры.Заполнить(ВыборкаНакладная);
			ТабДок.Вывести(ОбластьНакладная, ВыборкаНакладная.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаНакладная.Сумма;
		КонецЦикла;
        Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
