
Процедура ОбработкаПроведения(Отказ, Режим)   
	
	// регистр Отгрузки
	Движения.Отгрузки.Записывать = Истина;
	Для Каждого ТекСтрокаНакладная Из Накладная Цикл
		Движение = Движения.Отгрузки.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Продукт = ТекСтрокаНакладная.Продукт;
		Движение.Количество = ТекСтрокаНакладная.Количество;
		Движение.Сумма = ТекСтрокаНакладная.Сумма;
	КонецЦикла;

	// регистр ДвиженияДенежныхСредств Приход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Для Каждого ТекСтрокаНакладная Из Накладная Цикл
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтгрузок;
		Движение.СуммаПриход = ТекСтрокаНакладная.Сумма;  
		Если Оплата = Перечисления.СпособыОплаты.Безналичный Тогда
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
	Иначе
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;   
	КонецЕсли;
	КонецЦикла;

	// регистр ОстаткиПродукции Расход
	Движения.ОстаткиПродукции.Записывать = Истина;
	Для Каждого ТекСтрокаНакладная Из Накладная Цикл
		Движение = Движения.ОстаткиПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Название = ТекСтрокаНакладная.Продукт;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаНакладная.Количество;
	КонецЦикла;

	
	// регистр ИсторияОтгрузок
	Движения.ИсторияОтгрузок.Записывать = Истина;
	Для Каждого ТекСтрокаНакладная Из Накладная Цикл
		Движение = Движения.ИсторияОтгрузок.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.ВидНакладной = ВидНакладной;
		Движение.Склад = Склад;
		Движение.Сумма = ТекСтрокаНакладная.Сумма;
	КонецЦикла;

КонецПроцедуры
