
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияЗаявок
	Движения.ИсторияЗаявок.Записывать = Истина;
	Движение = Движения.ИсторияЗаявок.Добавить();
	Движение.Период = Дата;
	Движение.Ресторан = Ресторан;
	Движение.Клиент = Клиент;
	Движение.Услуга = Услуга;
	Движение.Сумма = Сумма;
   	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДатаОкончания = Дата + Длительность * 3600;         
	Если НЕ Важность = Истина Тогда
		Состояние = Неопределено
	КонецЕсли;
КонецПроцедуры


