
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиПродукции Приход
	Движения.ОстаткиПродукции.Записывать = Истина;
	Для Каждого ТекСтрокаПродукция Из Продукция Цикл
		Движение = Движения.ОстаткиПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;                
		Движение.Склад = Склад;
		Движение.Название = ТекСтрокаПродукция.Продукт;
		Движение.Количество = ТекСтрокаПродукция.Количество;
	КонецЦикла;
	
	// регистр ОстаткиСырья Расход
	Движения.ОстаткиСырья.Записывать = Истина;
	Для Каждого ТекСтрокаПродукция Из Продукция Цикл 
    Для Каждого СтрокаТабЧ Из ТекСтрокаПродукция.Продукт.Состав Цикл
        Движение = Движения.ОстаткиСырья.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;   
		Движение.Склад = Склад;
		Движение.ТипСырья = СтрокаТабЧ.Сырье.ТипСырья;
		Движение.Название = СтрокаТабЧ.Сырье;
        Движение.Количество = СтрокаТабЧ.Количество;
	КонецЦикла;                                        
КонецЦикла;             
    // регистр РабочееВремя Оборот
	Движения.РабочееВремя.Записывать = Истина;
	Для каждого ТекСтрокаСотрудники из Сотрудники Цикл
		Движение = Движения.РабочееВремя.Добавить();     
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;  
		Движение.Месяц = НачалоМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Часы = 8;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
