
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиСырья Приход
	Движения.ОстаткиСырья.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ОстаткиСырья.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;    
		Движение.Склад = Склад;
		Движение.Название = ТекСтрокаСостав.Сырье;
		Движение.ТипСырья = ТекСтрокаСостав.ТипСырья;
		Движение.Количество = ТекСтрокаСостав.Количество;
	КонецЦикла;

	// регистр РабочееВремя Приход
	Движения.РабочееВремя.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.РабочееВремя.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;        
		Движение.Месяц = НачалоМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Часы = 8;
	КонецЦикла;

	// регистр ОстаткиЖивотных Расход
	Движения.ОстаткиЖивотных.Записывать = Истина;
	Движение = Движения.ОстаткиЖивотных.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;        
	Движение.Склад = Склад;
	Движение.Название = Название;
	Движение.Количество = Количество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
