
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// Заполнение шапки
		Покупатель = ДанныеЗаполнения.Заказчик;
		Заказ = ДанныеЗаполнения.Ссылка;        
		Для каждого ТекСтрокаПереченьТоваров Из ДанныеЗаполнения.ПереченьТоваров Цикл 
			НоваяСтрока = СоставЗаказа.Добавить();   
			НоваяСтрока.Название = ТекСтрокаПереченьТоваров.Название;   
			НоваяСтрока.Размер = ТекСтрокаПереченьТоваров.Размер;
			НоваяСтрока.Цвет = ТекСтрокаПереченьТоваров.Цвет;    
			НоваяСтрока.Цена = ТекСтрокаПереченьТоваров.Цена;
			НоваяСтрока.Количество = ТекСтрокаПереченьТоваров.Количество;
			НоваяСтрока.Сумма = ТекСтрокаПереченьТоваров.Сумма;     	
		КонецЦикла;                                     
	КонецЕсли;   
	    Сумма = СоставЗаказа.Итог("Сумма");
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ДвиженияДенежныхСредств Приход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Движение = Движения.ДвиженияДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Если СпособОплаты = Перечисления.ВидыОплаты.Наличные ТОГДА
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные; 
	Иначе
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;  
	КонецЕсли;             
	ЗаказыПокупателей = Документы.ЗаказПокупателя.Выбрать();
	Пока ЗаказыПокупателей.Следующий() Цикл         
		Если заказыПокупателей.Ссылка = Заказ Тогда
			ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект();
			Если ЧастичныйРасчет Тогда          
				Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ЧастичнаяОплатаОтКлиента;
				Движение.СуммаПриход = СуммаОплаты;  
				ЗакПокРек.СтатусОплаты = Перечисления.СтатусыЗаказов.ЧастичноОплачен;  
				ЗакПокРек.Записать();
			Иначе 
				Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтКлиента;
				Движение.СуммаПриход = Сумма;      
				ЗакПокРек.СтатусОплаты = Перечисления.СтатусыЗаказов.Оплачен;    
				ЗакПокРек.Записать();  
			КонецЕсли;   
		КонецЕсли;
	КонецЦикла;     
	ЗакПокРек.Записать(РежимЗаписиДокумента.Проведение);
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
