#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		Состояние = ТекущийОбъект.Состояние.Получить();  
		
		 // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокВыбораВремени();        
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды       
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Важность = Истина Тогда
	ТекущийОбъект.Состояние = Новый ХранилищеЗначения(Состояние);
КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Изменение_Заявки");  
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
КонецПроцедуры                    


#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы



&НаКлиенте
Процедура УслугаПриИзменении(Элемент)    
	Если Объект.Услуга.Пустая() Тогда 
		Объект.Длительность = 0;
		Объект.Сумма = 0;
	Иначе
	ИнформацияОбУслуге = ПолучитьИнформациюОбУслуге(Объект.Услуга, Объект.Дата);
	Объект.Длительность = ИнформацияОбУслуге.Длительность;
    Объект.Сумма = ИнформацияОбУслуге.Цена;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервереБезКонтекста
Функция ПолучитьИнформациюОбУслуге(Услуга, Дата)
	
	Результат = Новый Структура("Длительность, Цена", 0, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныУслугСрезПоследних.Цена, 0) КАК Цена,
		|	Услуги.Длительность КАК Длительность
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныУслуг.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныУслугСрезПоследних
		|		ПО Услуги.Ссылка = ЦеныУслугСрезПоследних.Услуга
		|ГДЕ
		|	Услуги.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();	                      
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка); 
	КонецЕсли;
	
    Возврат Результат;  
	Сообщить("Услуга: " + Услуга);
	Сообщить("Дата: " + Дата);	
КонецФункции

&НаСервере
Процедура ОбновитьСписокВыбораВремени()
	
	НомерДняНедели	 = ДеньНедели(Объект.Дата);
	
	ДниНедели = Новый Соответствие;
	ДниНедели.Вставить(1, Перечисления.ДниНедели.Понедельник);
	ДниНедели.Вставить(2, Перечисления.ДниНедели.Вторник);
	ДниНедели.Вставить(3, Перечисления.ДниНедели.Среда);
	ДниНедели.Вставить(4, Перечисления.ДниНедели.Четверг);
	ДниНедели.Вставить(5, Перечисления.ДниНедели.Пятница);
	ДниНедели.Вставить(6, Перечисления.ДниНедели.Суббота);
	ДниНедели.Вставить(7, Перечисления.ДниНедели.Воскресенье);
	
	ДеньНедели = ДниНедели.Получить(НомерДняНедели);
	
	Элементы.Время.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РестораныРежимРаботы.ВремяОткрытия КАК ВремяОткрытия,
		|	РестораныРежимРаботы.ВремяЗакрытия КАК ВремяЗакрытия
		|ИЗ
		|	Справочник.Рестораны.РежимРаботы КАК РестораныРежимРаботы
		|ГДЕ
		|	РестораныРежимРаботы.Ссылка = &Ресторан
		|	И РестораныРежимРаботы.ДеньНедели = &ДеньНедели";
	
	Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели);
	Запрос.УстановитьПараметр("Ресторан", Объект.Ресторан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ИнтервалЗаявки = 900;//15 минут
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	    Выборка = РезультатЗапроса.Выбрать();
	    Выборка.Следующий(); 
		
		ТекВремя = Выборка.ВремяОткрытия;
		
		Пока ТекВремя < Выборка.ВремяЗакрытия Цикл
			
			ДатаВремя = НачалоДня(Объект.Дата) + (ТекВремя - '00010101');
			Элементы.Время.СписокВыбора.Добавить(ДатаВремя, Формат(ДатаВремя, "ДФ=ЧЧ:мм"));
			ТекВремя = ТекВремя + ИнтервалЗаявки;
		КонецЦикла;
			
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьЗаказ(Команда)       
	Если Объект.Ссылка.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сначала сохраните заявку";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	
	СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.ОбработкаЗаказа.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти    

&НаКлиенте
Процедура СоставЗаказаКоличествоПриИзменении(Элемент)
СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаЦенаПриИзменении(Элемент)
СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);	
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаМенюПриИзменении(Элемент)
// Получить текущую строку табличной части.
СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
// Установить цену.
СтрокаТабличнойЧасти.Цена = МодульАвтоЦена.АктуальнаяЦенаМеню( 

Объект.Дата, СтрокаТабличнойЧасти.Меню);    
СтрокаТабличнойЧасти.Количество = 1;
// Пересчитать сумму строки
РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры




