Процедура ОтменаОплатыОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	 // Проверяем, что источник — это документ "Оплата"
    Если Источник.Ссылка = Источник.Ссылка Тогда
        // Получаем связанные заказы, чтобы изменить их статус на "НеОплачен"
        ЗаказыПокупателей = Документы.ЗаказКлиента.Выбрать();
        Пока ЗаказыПокупателей.Следующий() Цикл
            Если ЗаказыПокупателей.Ссылка = Источник.Заказ Тогда
                ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект();
                // Меняем статус на "НеОплачен"
                ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.ОплатаОтменена;
                ЗакПокРек.Записать();
            КонецЕсли;
        КонецЦикла;
	КонецЕсли;
КонецПроцедуры   

Процедура ОтменаОтправкиОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	 // Проверяем, что источник — это документ "Оплата"
    Если Источник.Ссылка = Источник.Ссылка Тогда
        // Получаем связанные заказы, чтобы изменить их статус на "НеОплачен"
        ЗаказыПокупателей = Документы.ЗаказКлиента.Выбрать();
        Пока ЗаказыПокупателей.Следующий() Цикл
            Если ЗаказыПокупателей.Ссылка = Источник.Заказ Тогда
                ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект();
                // Меняем статус на "НеОплачен"
                ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.ДоставкаОтменена; 
				ЗакПокРек.ДатаВыдачи = Неопределено;
                ЗакПокРек.Записать();
            КонецЕсли;
        КонецЦикла;
	КонецЕсли;
КонецПроцедуры


