Процедура ПечатьОплатаЗаказа(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьОплатаЗаказа)
	Макет = Документы.Оплата.ПолучитьМакет("ПечатьОплатаЗаказа");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оплата.Дата КАК ДатаОплаты,
	|	Оплата.Заказ КАК Заказ,
	|	Оплата.Номер КАК Номер,
	|	Оплата.Ресторан КАК Ресторан,
	|	Оплата.СпособОплаты КАК СпособОплаты,
	|	ОбработкаЗаказа.СоставЗаказа.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Меню КАК Меню,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК СоставЗаказа,
	|	ОбработкаЗаказа.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Сумма КАК Сумма,
	|		Сотрудник КАК Сотрудник
	|	) КАК Услуги,
	|	Рестораны.Адрес КАК Адрес,
	|	Рестораны.Телефон КАК Телефон,
	|	Рестораны.Логотип КАК Логотип,
	|	ОбработкаЗаказа.Номер КАК НомерЗаказа,
	|	ОбработкаЗаказа.Дата КАК ДатаЗаказа
	|ИЗ
	|	Документ.Оплата КАК Оплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбработкаЗаказа КАК ОбработкаЗаказа
	|		ПО Оплата.Заказ = ОбработкаЗаказа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Рестораны КАК Рестораны
	|		ПО Оплата.Ресторан = Рестораны.Ссылка
	|ГДЕ
	|	Оплата.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(); 
	ОбластьПодзаголовок = Макет.ПолучитьОбласть("Подзаголовок");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");    
	ОбластьСоставЗаказаШапка = Макет.ПолучитьОбласть("СоставЗаказаШапка");
	ОбластьСоставЗаказа = Макет.ПолучитьОбласть("СоставЗаказа");  
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");   
	ОбластьПечать = Макет.ПолучитьОбласть("Печать");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		// Вывод логотипа
		Если НЕ Выборка.Логотип.Пустая() Тогда
			ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Логотип);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаЛоготип = Новый Картинка(ДвоичныеДанные);
				ОбластьЗаголовок.Рисунки.Логотип.Картинка = КартинкаЛоготип;
			КонецЕсли;
		КонецЕсли;
		
		Номер = Выборка.Номер;
		ДатаОплаты = Выборка.ДатаОплаты; 
		ДатаЗаказа = Выборка.ДатаЗаказа;
		НомерЗаказа = Выборка.НомерЗаказа;   
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.ДатаОплаты = ДатаОплаты;  
		ОбластьЗаголовок.Параметры.ДатаЗаказа = ДатаЗаказа;
		ОбластьЗаголовок.Параметры.НомерЗаказа = НомерЗаказа;    
		ТабДок.Вывести(ОбластьЗаголовок);       
		
		Ресторан = Выборка.Ресторан;
		Адрес = Выборка.Адрес;
		Телефон = Выборка.Телефон;  
		ОбластьПодзаголовок.Параметры.Ресторан = Ресторан;
		ОбластьПодзаголовок.Параметры.Адрес = Адрес;
		ОбластьПодзаголовок.Параметры.Телефон = Телефон;
		ТабДок.Вывести(ОбластьПодзаголовок);
		
		//Результат = Запрос.Выполнить().Выгрузить();
		СуммаИтог = 0;                      
		
		ЕСЛИ НЕ Выборка.Услуги.Пустой() ТОГДА
			ТабДок.Вывести(ОбластьУслугиШапка);
			ВыборкаУслуги = Выборка.Услуги.Выбрать();      
			Пока ВыборкаУслуги.Следующий() Цикл
				ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
				ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень()); 
				СуммаИтог = СуммаИтог + ВыборкаУслуги.Сумма;
			КонецЦикла;
		КонецЕсли;     
		
		ТабДок.Вывести(ОбластьРазделитель);
		
		ВыборкаСоставЗаказа = Выборка.СоставЗаказа.Выбрать();
		ЕСЛИ НЕ Выборка.СоставЗаказа.Пустой() Тогда
			ТабДок.Вывести(ОбластьСоставЗаказаШапка);
			Пока ВыборкаСоставЗаказа.Следующий() Цикл
				ОбластьСоставЗаказа.Параметры.Заполнить(ВыборкаСоставЗаказа);
				ТабДок.Вывести(ОбластьСоставЗаказа, ВыборкаСоставЗаказа.Уровень());
				СуммаИтог = СуммаИтог + ВыборкаСоставЗаказа.Сумма;
			КонецЦикла; 
		КонецЕсли;
		
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		ОбластьИтог.Параметры.Ответственный = ТекПользователь;
		ОбластьИтог.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);  
		ТабДок.Вывести(ОбластьИтог);      
		ТабДок.Вывести(ОбластьПечать);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
