
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОбработкаЗаказа") Тогда
		// Заполнение шапки
		Заявка = ДанныеЗаполнения.Заявка;
		Клиент = ДанныеЗаполнения.Клиент;
		Ресторан = ДанныеЗаполнения.Ресторан;
		Сумма = ДанныеЗаполнения.СоставЗаказа.Итог("Сумма")+ДанныеЗаполнения.Услуги.Итог("Сумма");
		Заказ = ДанныеЗаполнения.Ссылка;    
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДвиженияДенежныхСредств
	    Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Ресторан = Ресторан; 
		Если СпособОплаты = Перечисления.СпособыОплаты.Наличные ТОГДА
	    Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные; 
	Иначе
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;  
		КонецЕсли;
		Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтКлиента;
		Движение.СуммаПриход = Сумма;
		
КонецПроцедуры                                                                      
	


//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОбработкаЗаказа") Тогда
		// Заполнение шапки
		///Клиент = ДанныеЗаполнения.Клиент;
		///Ресторан = ДанныеЗаполнения.Ресторан;    
		///Заказ = ДанныеЗаполнения.Ссылка;   
		//Заявка = ДанныеЗаполнения.Заявка;
		//Сумма = ДанныеЗаполнения.СоставЗаказа.Итог("Сумма") + ДанныеЗаполнения.Услуги.Итог("Сумма");
	//КонецЕсли;
