
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РасчетЗарплаты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетЗарплаты.Дата,
	|	РасчетЗарплаты.Месяц,
	|	РасчетЗарплаты.Номер,
	|	РасчетЗарплаты.Оплата,
	|	РасчетЗарплаты.Сотрудники.(
	|		НомерСтроки,
	|		Сотрудник,
	|		Отработано,
	|		Оклад,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РасчетЗарплаты КАК РасчетЗарплаты
	|ГДЕ
	|	РасчетЗарплаты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Разделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.Дата = Дата;
				
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл       
			ТабДок.Вывести(ОбластьЗаголовок);
		    Шапка.Параметры.Заполнить(Выборка);
		    ТабДок.Вывести(Шапка, Выборка.Уровень());
            СуммаИтог = 0;                            
			ТабДок.Вывести(ОбластьСотрудникиШапка);
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());
		    СуммаИтог = СуммаИтог + ВыборкаСотрудники.Сумма;         
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Подвал.Параметры.Ответственный = ТекПользователь;
		Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);        
		ТабДок.Вывести(Разделитель);
        ТабДок.ВывестиГоризонтальныйРазделительСтраниц();  
		ТабДок.Вывести(Разделитель);
		КонецЦикла;  
   КонецЦикла;
	//}}
КонецПроцедуры
