
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Зарплаты Расход
	Движения.Зарплаты.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплаты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Месяц = Месяц;
		Движение.Сумма = ТекСтрокаСотрудники.Сумма;
		Движение.Отработано = ТекСтрокаСотрудники.Отработано;
	КонецЦикла;

	// регистр ДвиженияДенежныхСредств Приход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплат;
		Движение.СуммаРасход = ТекСтрокаСотрудники.Сумма;    
	Если Оплата = Перечисления.СпособыОплаты.Безналичный Тогда
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
	Иначе
		Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;      
	КонецЕсли;

	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
