#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Перебираем каждую строку товаров из перечня текущего объекта
    Для Каждого СтрокаТовара Из ТекущийОбъект.СоставЗаказа Цикл
        // Создаем новый запрос для получения цены товара
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |	ЕСТЬNULL(ЦеныТоваровСрезПоследних.Цена, 0) КАК Цена
        |ИЗ
        |	РегистрСведений.ЦеныТоваров.СрезПоследних КАК ЦеныТоваровСрезПоследних
        |ГДЕ
        |	ЦеныТоваровСрезПоследних.Товар = &Товар
        |	И ЦеныТоваровСрезПоследних.ITСервис = &ITСервис"; // Условие для получения цены товара
        
        // Устанавливаем параметр "Товар" для запроса   
		Запрос.УстановитьПараметр("ITСервис", Объект.ITСервис);
        Запрос.УстановитьПараметр("Товар", СтрокаТовара.Название);
        
        // Выполняем запрос и получаем результат
        РезультатЗапроса = Запрос.Выполнить();
        // Проверяем, есть ли данные в результате запроса
        Если НЕ РезультатЗапроса.Пустой() Тогда
            // Если данные есть, выбираем их
            Выборка = РезультатЗапроса.Выбрать();
            Выборка.Следующий(); // Переходим к первой записи
            // Обновляем цену товара в строке
            СтрокаТовара.Цена = Выборка.Цена;  
        КонецЕсли;  
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды    
	
	// Проверяем, пустой ли статус объекта
	Если Объект.СтатусЗаказа.Пустая() Тогда
		// Если статус пустой, устанавливаем его в "Новый"
		Объект.СтатусЗаказа = Перечисления.СтатусыЗаказов.Новый;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
    // Получаем текущую дату без времени (начало дня)
    ТекДата = НачалоДня(ТекущаяДата());          
    
    // Перебираем каждую строку товаров из перечня текущего объекта
    Для Каждого СтрокаТовара Из ТекущийОбъект.СоставЗаказа Цикл
        // Создаем набор записей для регистра "ЦеныТоваров"
        НаборЗаписей = РегистрыСведений.ЦеныТоваров.СоздатьНаборЗаписей();   
		//Устанавливаем отбор по сервису
		НаборЗаписей.Отбор.ITСервис.Установить(Объект.ITСервис);
        // Устанавливаем отбор по текущей дате
        НаборЗаписей.Отбор.Период.Установить(ТекДата);
        // Устанавливаем отбор по названию товара
        НаборЗаписей.Отбор.Товар.Установить(СтрокаТовара.Название);
        // Читаем записи из регистра
        НаборЗаписей.Прочитать();
        
        // Флаг, указывающий на наличие изменений
        ЕстьИзменения = Ложь;
        // Проверяем, есть ли записи для данного товара
        Если НаборЗаписей.Количество() = 0 Тогда
            // Если записей нет, добавляем новую запись
            Запись = НаборЗаписей.Добавить();
            Запись.Период = ТекДата;        
			Запись.ITСервис = Объект.ITСервис;
            Запись.Товар = СтрокаТовара.Название;
            Запись.Цена = СтрокаТовара.Цена;  
            
            // Устанавливаем флаг изменения
            ЕстьИзменения = Истина;
        Иначе
            // Если записи есть, получаем первую запись
            Запись = НаборЗаписей.Получить(0);
            // Сравниваем цену из регистра с ценой в строке товара
            Если Запись.Цена <> СтрокаТовара.Цена Тогда
                ЕстьИзменения = Истина; // Устанавливаем флаг изменения
                Запись.Цена = СтрокаТовара.Цена; // Обновляем цену
            КонецЕсли;
        КонецЕсли;
        
        // Если были изменения, записываем их в регистр
        Если ЕстьИзменения Тогда
            НаборЗаписей.Записать();
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура Оплатить(Команда)	
	// Флаг, указывающий на то, был ли документ записан
	ДокументЗаписан = Ложь;

	// Проверяем, пустая ли ссылка на объект (документ)
	Если Объект.Ссылка.Пустая() Тогда
		// Если ссылка пустая, создаем новый документ в режиме проведения
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);   
	Иначе 
		// Если ссылка не пустая, документ уже существует, устанавливаем флаг в истину
		ДокументЗаписан = Истина;
	КонецЕсли;
	
	// Если документ успешно записан
	Если ДокументЗаписан Тогда
		// Подготавливаем параметры для открытия формы
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		// Открываем форму оплаты с блокировкой окна владельца
		ОткрытьФорму("Документ.Оплата.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Накладная(Команда)  
	// Флаг, указывающий на то, был ли документ записан
	ДокументЗаписан = Ложь;	

	// Проверяем, пустая ли ссылка на объект (документ)
	Если Объект.Ссылка.Пустая() Тогда
		// Если ссылка пустая, создаем новый документ в режиме проведения
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);   
	Иначе 
		// Если ссылка не пустая, документ уже существует, устанавливаем флаг в истину
		ДокументЗаписан = Истина;
	КонецЕсли;
	
	// Если документ успешно записан
	Если ДокументЗаписан Тогда
		// Подготавливаем параметры для открытия формы
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		// Открываем форму плана производства с блокировкой окна владельца
		ОткрытьФорму("Документ.Накладная.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры
    

&НаКлиенте
Процедура СоставЗаказаНазваниеПриИзменении(Элемент) 
	
	// Получить текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	// Устанавливаем цену для текущей строки табличной части
	СтрокаТабличнойЧасти.Цена = АвтоЦена.АктуальнаяЦенаТоваров( 
		Объект.Дата, СтрокаТабличнойЧасти.Название);    
	// Устанавливаем количество товара равным 1
	СтрокаТабличнойЧасти.Количество = 1;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаЦенаПриИзменении(Элемент)
	
	// Получаем текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаКоличествоПриИзменении(Элемент)  
	
	// Получаем текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры
