
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		ITСервис = ДанныеЗаполнения.ITСервис;
		Актив = ДанныеЗаполнения.Актив;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ПричинаОбращения = ДанныеЗаполнения.ПричинаОбращения;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Заявка = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияСтатусовАктива
	Движения.ИсторияСтатусовАктива.Записывать = Истина;
	Движение = Движения.ИсторияСтатусовАктива.Добавить();
	Движение.Период = Дата;
	Движение.Актив = Актив;
	Движение.Владелец = Контрагент;
	Движение.Статус = СтатусАктива;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
