Функция АктуальнаяЦенаУслуг(АктуальнаяДата, ЭлементУслуга) Экспорт
// Создать вспомогательный объект "Отбор".
Отбор = Новый Структура("Услуга", ЭлементУслуга);
// Получить актуальные значения ресурсов регистра.
ЗначенияРесурсов = РегистрыСведений.ЦеныУслуг.ПолучитьПоследнее(АктуальнаяДата, Отбор);
Возврат ЗначенияРесурсов.Цена;
КонецФункции        

Функция АктуальнаяЦенаТоваров(АктуальнаяДата, ЭлементТовар) Экспорт
	// Создать вспомогательный объект "Отбор".
	Отбор = Новый Структура("Товар", ЭлементТовар);
	// Получить актуальные значения ресурсов регистра.
	ЗначенияРесурсов = РегистрыСведений.ЦеныТоваров.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначенияРесурсов.Цена;      
КонецФункции        

                                                    	