&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Цена = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите цену";
		Сообщение.Поле = "Цена";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	ТекДата = НачалоДня(ТекущаяДата());          
	
	НаборЗаписей = РегистрыСведений.ЦеныМеню.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекДата);
  	НаборЗаписей.Отбор.Меню.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Отбор.Ресторан.Установить(Объект.Ресторан.Ссылка);
	НаборЗаписей.Прочитать();
	
	ЕстьИзменения = Ложь;
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекДата;     
		Запись.Ресторан = Объект.Ресторан.Ссылка;
		Запись.Меню = ТекущийОбъект.Ссылка;
		Запись.Цена = Цена;  
		
		ЕстьИзменения = Истина;
	Иначе
		Запись = НаборЗаписей.Получить(0);
		Если Запись.Цена <> Цена Тогда
			ЕстьИзменения = Истина;
			Запись.Цена = Цена;
		КонецЕсли;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныМенюСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныМеню.СрезПоследних(, Меню = &Меню) КАК ЦеныМенюСрезПоследних
		|ГДЕ
		|	ЦеныМенюСрезПоследних.Ресторан = &Ресторан";
	
	Запрос.УстановитьПараметр("Меню", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("Ресторан", Объект.Ресторан);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Цена = Выборка.Цена;
	КонецЕсли;
КонецПроцедуры



#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
  	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();    
	ПараметрыГиперссылки.Размещение = "Картинка"; 
	ПараметрыГиперссылки.Видимость = Ложь;

    ПараметрыПоля = РаботаСФайлами.ПолеФайла();    
	ПараметрыПоля.ПутьКДанным = "Объект.Фото";
	ПараметрыПоля.ПутьКДаннымИзображения = "АдресКартинки";
	ПараметрыПоля.Размещение = "Картинка";  
	ПараметрыПоля.ПоказыватьКоманднуюПанель = Ложь;
	
	ДобавляемыеЭлементы = Новый Массив;
    ДобавляемыеЭлементы.Добавить(ПараметрыГиперссылки);
    ДобавляемыеЭлементы.Добавить(ПараметрыПоля);
    РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ДобавляемыеЭлементы);
   // Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
   РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
   // Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
    РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
    // Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры   


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы	

  // СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами


#КонецОбласти

#Область ОбработчикиКомандФормы

  // СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
    РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами


#КонецОбласти

