Функция ГлавныйITСервис() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ITСервисы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ITСервисы КАК ITСервисы
		|ГДЕ
		|   НЕ ITСервисы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();        
	
	ITСервис = Справочники.ITСервисы.ПустаяСсылка();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий(); 
		ITСервис = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ITСервис;
	
КонецФункции