
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)     
	
	// Проверка типа документа
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Производство") Тогда
		
		// Получаем документ ЗаказПокупателя, связанный с текущим Производством      
		Заказ = ДанныеЗаполнения.Заказ;
		ЗаказПокупателя = ДанныеЗаполнения.Заказ;                
		Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
			// Запрос для получения позиций из табличной части "ПереченьТоваров" документа ЗаказПокупателя
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|   Товары.Название КАК Название,
			|   Товары.Цена КАК Цена,
			|   Товары.Сумма КАК Сумма
			|ИЗ
			|   Документ.ЗаказПокупателя.ПереченьТоваров КАК Товары
			|ГДЕ
			|   Товары.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателя);
			
			// Выполняем запрос
			РезультатЗапроса = Запрос.Выполнить();
			ТаблицаЗаказПокупателя = РезультатЗапроса.Выгрузить();
			// Заполнение таблицы из Производства
			Для Каждого ТекСтрокаПроизведенныеДвери Из ДанныеЗаполнения.ПроизведенныеДвери Цикл
				// Добавляем новую строку в Накладную
				НоваяСтрока = Накладная.Добавить();
				НоваяСтрока.Количество = ТекСтрокаПроизведенныеДвери.Количество;
				НоваяСтрока.Название = ТекСтрокаПроизведенныеДвери.Название;
				НоваяСтрока.Размер = ТекСтрокаПроизведенныеДвери.Размер;
				НоваяСтрока.Цвет = ТекСтрокаПроизведенныеДвери.Цвет;
				
				// Поиск соответствующей позиции в ПереченьТоваров ЗаказаПокупателя по полю "Название"
				СтрокаЗаказа = ТаблицаЗаказПокупателя.Найти(ТекСтрокаПроизведенныеДвери.Название, "Название");
				
				Если СтрокаЗаказа <> Неопределено Тогда
					// Заполняем цену и сумму, если найдена соответствующая строка
					НоваяСтрока.Цена = СтрокаЗаказа.Цена;
					НоваяСтрока.Сумма = СтрокаЗаказа.Сумма;
				КонецЕсли;
			КонецЦикла;  
		КонецЕсли;
	КонецЕсли;      
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)  
	
	// Выбираем все документы "ЗаказПокупателя" из базы данных
	ЗаказыПокупателей = Документы.ЗаказПокупателя.Выбрать();
	
	// Начинаем цикл по всем заказам покупателей
	Пока ЗаказыПокупателей.Следующий() Цикл
		// Проверяем, соответствует ли текущий заказ тому, который мы хотим провести
		Если ЗаказыПокупателей.Ссылка = Заказ Тогда   
			// Получаем объект текущего заказа покупателя
			ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект();   
			
			// Проверяем статус заказа
			Если ЗакПокРек.Статус <> Перечисления.СтатусыЗаказов.Выполнен Тогда
				// Если статус не "Выполнен", выводим сообщение об ошибке
				Сообщить("Документ не может быть проведен, т.к товар еще не готов");
				Отказ = Истина; // Устанавливаем флаг отказа
				Возврат;      // Завершаем выполнение процедуры
			ИначеЕсли ЗакПокРек.Статус = Перечисления.СтатусыЗаказов.Выдан Тогда
				// Если статус "Выдан", выводим соответствующее сообщение
				Сообщить("Документ не может быть проведен, т.к товар уже выдан."); 
				Отказ = Истина; // Устанавливаем флаг отказа
				Возврат;     // Завершаем выполнение процедуры
			ИначеЕсли ЗакПокРек.СтатусОплаты <> Перечисления.СтатусыЗаказов.Оплачен Тогда
				// Если заказ не оплачен, выводим сообщение об этом
				Сообщить("Документ не может быть проведен, т.к товар еще не оплачен"); 
				Отказ = Истина; // Устанавливаем флаг отказа
				Возврат; // Завершаем выполнение процедуры
			КонецЕсли;
			
			// Если все проверки пройдены, обновляем статус заказа
			ЗакПокРек.Статус = Перечисления.СтатусыЗаказов.Выдан;
			ЗакПокРек.ДатаВыдачи = Дата;   // Устанавливаем дату выдачи
			ЗакПокРек.Записать();     // Сохраняем изменения в заказе
		КонецЕсли;
	КонецЦикла; // Завершаем цикл по заказам покупателей
	
	// Записываем изменения в документ с учетом режима проведения
	ЗакПокРек.Записать(РежимЗаписиДокумента.Проведение);   
	
КонецПроцедуры
